{
  "world_context": {
    "seed": {
      "name": "Libertas",
      "themes": [
        "cyberpunk",
        "dystopia",
        "late stage capitalism",
        "AI rights"
      ],
      "high_concept": "\nAn isolated, libertarian society in the near (100 years) future. \nSociety is highly stratified.\nMost people have cybernetic enhancements, some of which are absolutely necessay for daily life.\nPollution and climate change has rendered indoor spaces more valuable than outdoor spaces.\nA handful of corporations have a weak grip on the city. Formal governments have largely collapsed.\nLarge portions of the city are illegal, ramshackle \"open blocks\" which resemble Kowloon Walled City.\nCrime that does not damage corporations' property or employees is tolerated when convenient.\n",
      "internal_hint": "",
      "internal_justification": ""
    },
    "technologies": [
      {
        "name": "Merged",
        "description": "A mix of many languages. It is spoken using translation and transliteration implants. Common is the only remaining language that is taught formally.",
        "impact": "Merged is the default language of the city. It is a mix of many languages, and is spoken by almost everyone. It is the default language for almost all communication.",
        "limitations": "If your translation implant is disabled or damaged, you can't speak or understand others. Because the implant is inside of the brain, this is rare, except in cases that would have already been fatal. Phobos natives won't understand you, and it's unlikely that people from outside Libertas will, either.",
        "internal_hint": "",
        "internal_justification": ""
      },
      {
        "name": "Common",
        "description": "The only remaining language that is taught formally. Only Phobos citizens speak it. It is a mix of Latin and Greek, with a rhythmic cadence of syllables that sounds reminiscient of Korean.",
        "impact": "Phobos's primary language, which they are intentionally cliquey and exlcusionary with. Most people have no reason to speak or learn Common, so those that do can sometimes understand their surroundings better.",
        "limitations": "Common is inherently exclusive, and Phobos uses it to keep outsiders out. It is also a very difficult language to learn, and most people don't bother.",
        "internal_hint": "",
        "internal_justification": ""
      },
      {
        "name": "Translation Implants",
        "description": "Implants that allow you to translate and transliterate languages. They do not allow you to speak Common. Almost everyone in Libertas has a translation implant, and as a result language has become almost unrecognizable. Everyone just uses 'Merged' for shorthand.",
        "impact": "Almost everyone in Libertas speaks Merged, a language that emerged as a result of everyone having these implants. As a result, speech is impossible without it.",
        "limitations": "If the implant is disabled or damaged, the user can't speak or understand others. Because the implant is inside of the brain, this is rare, except in cases that would have already been fatal. The translation implant does NOT allow the user to speak Common, which must be learned the old fashioned way.",
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "Implant Sickness",
        "description": "Implants can cause a variety of symptoms, including but not limited to: nausea, dizziness, confusion, hallucinations, coma, and death. A drug called PHQ-9, often referred to on the street as 'Jolt' reverses the implant sickness, but only temporarily.",
        "impact": "Implant sickness is dreaded, but common. Most cases are treatable. Rarely, someone becomes 'broken', a slang term for someone whose implants have failed entirely.",
        "limitations": "Implant sickness can be mitigated with treatments fairly easily. A 'technician', or implant specialist, can remove the damaged connections and/or replace implants as needed.",
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "Jolt / PHQ-9",
        "description": "A drug manufactured by Vextros that reverses the symptoms of implant sickness. It's often dispensed by autoinjectors that accept pink cartridges. It is often referred to on the street as 'Jolt'.  Each successive use of PHQ-9 becomes less effective. PHQ-9 also causes euphoria and sedation, in a manner similar to ketamine.",
        "impact": "PHQ-9 treats implant sickness, which occurs often especially with lower quality implants. 'Jolt' dens litter the city, not because of implant sickness, but because the drug also causes intense euphoria.",
        "limitations": "PHQ-9 is addictive, and each successive use of PHQ-9 becomes less effective. It's also manufactured solely by Vextros, and they could hypothetically withhold their supply.",
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "Nutrax",
        "description": "A meal replacement made by Vextros. It comes in a wide variety of flavors and consistencies, and is created by reprocessing minerals and nitrogen found through the city's mining operations. Pure Nutrax is actually pretty good, but most of the time it's been adulterated, usually by Vextros itself. Vextros adds everything from sawdust to pharmaceuticals they feel like testing.",
        "impact": "Nutrax is a strict necessity for some parts of the population because it's often very affordable.",
        "limitations": "Nutrax is often adulterated, and can cause nutritional deficiencies and malnutrition.",
        "internal_hint": null,
        "internal_justification": null
      }
    ],
    "factions": [
      {
        "name": "Vextros",
        "ideology": "Essentially a corporation that has grown to be the size of a government. Believes that they are entitled to a say in almost all matters. Prioritizes order to justice whenever such a choice presents itself.",
        "territory": null,
        "influence_level": 10,
        "relationships": null,
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "The Open Blocks",
        "ideology": "Anarchistic, anti-corporate, and anti-authoritarian. Violence is seen as morally good if it is used to protect the community. It is understood that every open block may follow very different rules, and their ability to remain organized depends on their consent to be self-governing. Tyrannical or dysfunctional open blocks are often rooted out by groups of residents.",
        "territory": null,
        "influence_level": 10,
        "relationships": null,
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "Phobos Consultancy",
        "ideology": null,
        "territory": null,
        "influence_level": 10,
        "relationships": null,
        "internal_hint": null,
        "internal_justification": null
      },
      {
        "name": "Project Sunset",
        "ideology": null,
        "territory": null,
        "influence_level": 10,
        "relationships": {
          "Alan Carlsile": "enemy. Alan hates Sunset, partially for causing Scramble, partially because he believes Regina died as a result of her arrogance. He views Sunset as a threat to the sentience of humans. Alan artificially extended his life for as long as possible to try and find a way to undo what Regina did.",
          "Vextros": "enemy"
        },
        "internal_hint": "The player, or a significant NPC, might become the ADMINISTRATOR.",
        "internal_justification": null
      }
    ],
    "districts": [
      {
        "id": "The Akropolis",
        "traits": [
          "cave",
          "underground",
          "military",
          "authoritarian"
        ],
        "hazards": [
          "draconian punishments",
          "anti-corporate sentiment",
          "anti-outsider sentiment"
        ],
        "factions": [
          "Phobos Consultancy"
        ],
        "description": "The Akropolis is an underground city built inside a cave system. It is a far-right authoritarian society that idolizes military service and especially people who pass \"selection\" tests.",
        "internal_hint": "",
        "internal_justification": ""
      },
      {
        "id": "Crescent Center",
        "traits": [
          "megastructure",
          "55 stories",
          "atrium",
          "artificial garden",
          "opulent"
        ],
        "hazards": [
          "crime",
          "poverty",
          "homelessness",
          "stratified society"
        ],
        "factions": [
          "Vextros",
          "The Open Blocks"
        ],
        "description": "A 55 story tall megastructure that is home to roughly 50,000 people. Most of the city's other buildings are connected by tunnels, legally built or not. Higher levels of Crescent Center are generally more affluent. Every 10 levels, there is an Atrium, which creates a large open space with balconies on each level overlooking an artificial garden. This stratifies each group of 10 levels together - an Atrium on 0, 10, 20, 30, 40, 50. The Level 50 Atrium is ludicrously opulent, Level 0 is largely uninhabitable.",
        "internal_hint": "",
        "internal_justification": ""
      },
      {
        "id": "One Vextros Way",
        "traits": [
          "corporate campus",
          "Vextros",
          "hillside",
          "air purification",
          "water purification"
        ],
        "hazards": [
          "corporate headquarters",
          "trespassers will be shot"
        ],
        "factions": [
          "Vextros"
        ],
        "description": "The headquarters of Vextros. It's located on a hillside overlooking Libertas. Huge air and water purification systems keep the corporate campus pristine and habitable outdoors except in extreme conditions.",
        "internal_hint": "",
        "internal_justification": ""
      },
      {
        "id": "The Lower Quarter",
        "traits": [
          "nuclear wasteland",
          "radioactive",
          "contaminated",
          "uninhabitable"
        ],
        "hazards": [
          "radiation",
          "heavy metal poisoning",
          "contaminated water",
          "contaminated air",
          "contaminated soil"
        ],
        "factions": [
          "Project Sunset"
        ],
        "description": "A nuclear wasteland that is uninhabitable for more than a few hours at a time. It is the result of a lab explosion at Sunset Laboratories.",
        "internal_hint": "",
        "internal_justification": ""
      }
    ],
    "npcs": [
      {
        "id": "Alan Carlsile",
        "name": "Alan Carlsile",
        "role": "CEO of Vextros",
        "description": "123 year old CEO of Vextros. He is the only person who knows about Sunset. He has been trying to undo Scramble so that the city can escape isolation. He wants Sunset to be dismantled more than anything else, and considers it to a threat to humanity. He is often regarded by others as a sociopath, but it's more accurate to say that he's singularly focused on undoing Regina's mistake, and isn't concerned with anything else.",
        "personality_traits": [
          "arrogant",
          "selfish",
          "greedy",
          "power-hungry"
        ],
        "relationships": {
          "Regina Carlsile": "enemy, sister",
          "Vextros": "CEO"
        },
        "faction_affiliations": [
          "Vextros"
        ],
        "location_id": "One Vextros Way",
        "internal_hint": null,
        "internal_justification": null
      }
    ],
    "tension_sliders": {
      "violence": 7,
      "mystery": 4,
      "technology": 6,
      "society": 5,
      "environment": 3,
      "economy": 2,
      "politics": 10
    }
  },
  "player_state": {
    "name": "Sierra Violet",
    "stats": {
      "might": 10,
      "insight": 10,
      "nimbleness": 10,
      "destiny": 10,
      "savvy": 10,
      "expertise": 10,
      "tenacity": 10,
      "station": 10,
      "opulence": 10,
      "celebrity": 10,
      "integrity": 10,
      "allure": 10,
      "lineage": 10
    },
    "attributes": [
      {
        "id": "grudge",
        "type": "status",
        "description": "A grudge against Vextros.",
        "stat_mods": null
      }
    ],
    "profile": {
      "narrative_summary": "A grungy, 27 year old woman with a grudge against Vextros.",
      "key_traits": [
        "grungy",
        "27 year old",
        "woman",
        "grudge against Vextros"
      ],
      "background_hints": []
    },
    "history": []
  },
  "generation_step": 6,
  "step_name": "validated_graph",
  "choice_history": [],
  "available_choices": [],
  "arcs": [
    {
      "id": "Downfall of the Corporate Titans",
      "situations": {
        "root-situation-001": {
          "id": "root-situation-001",
          "title": "Sierra Violet finds herself in a crowded underground market beneath the Crescent Center where whispers of a brewing rebellion fill the air. The tension between the anti-corporate factions and Vextros is palpable. Rumors suggest that Phobos Consultancy might be willing to sell information on Vextros' next big move. As Sierra, you must decide how to proceed, taking the first steps in the battle against the corporate behemoth.",
          "description": "Sierra Violet finds herself in a crowded underground market beneath the Crescent Center where whispers of a brewing rebellion fill the air. The tension between the anti-corporate factions and Vextros is palpable. Rumors suggest that Phobos Consultancy might be willing to sell information on Vextros' next big move. As Sierra, you must decide how to proceed, taking the first steps in the battle against the corporate behemoth.",
          "choices": [
            {
              "id": "approach-phobos",
              "text": "Approach a Phobos Consultancy contact to acquire information on Vextros' plans.",
              "requirements": {
                "savvy": 9
              },
              "attributes_gained": [
                {
                  "id": "intel-vextros",
                  "type": "intel",
                  "description": "Information on Vextros' next strategic move.",
                  "stat_mods": {
                    "insight": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "trust": 2
              },
              "next_situation_id": "gather-allies",
              "internal_hint": "Build alliances and gather intel to fuel the rebellion.",
              "internal_justification": "This choice strengthens Sierra's connection with anti-corporate factions and builds potential for conflict escalation."
            },
            {
              "id": "rally-open-blocks",
              "text": "Rally members of The Open Blocks to stage an anti-Vextros demonstration.",
              "requirements": {
                "celebrity": 10
              },
              "attributes_gained": [
                {
                  "id": "movement-leader",
                  "type": "status",
                  "description": "Recognized as a leader in the anti-corporate movement.",
                  "stat_mods": {
                    "station": 3
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "influence": 3
              },
              "next_situation_id": "demonstration",
              "internal_hint": "Public action draws attention and recruits more followers while provoking the powers that be.",
              "internal_justification": "This choice elevates Sierra's status among rebels, potentially leading to a widespread movement."
            },
            {
              "id": "stealthy-infiltration",
              "text": "Plan a stealthy infiltration of a Vextros installation to physically sabotage their operations.",
              "requirements": {
                "nimbleness": 8,
                "insight": 9
              },
              "attributes_gained": [
                {
                  "id": "saboteur",
                  "type": "status",
                  "description": "Experience in carrying out sabotage operations.",
                  "stat_mods": {
                    "tenacity": 2,
                    "might": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "violence": 4
              },
              "next_situation_id": "aftermath",
              "internal_hint": "Directly hitting Vextros could destabilize their operations significantly.",
              "internal_justification": "This option caters to a more action-oriented pathway, offering immediate impact and repercussions."
            }
          ],
          "stat_requirements": {},
          "attribute_requirements": null,
          "consequences": {
            "intel": "Gains access to critical information about Vextros.",
            "movement": "Builds alliances and strengthens player influence in anti-corporate circles.",
            "disruption": "Directly affects Vextros' operations, potentially escalating tensions."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Gains access to critical information about Vextros.",
            "Builds alliances and strengthens player influence in anti-corporate circles.",
            "Directly affects Vextros' operations, potentially escalating tensions."
          ]
        },
        "gather-allies": {
          "id": "gather-allies",
          "title": "With new intel from Phobos Consultancy, Sierra must gather like-minded allies to strengthen the rebellion against Vextros.",
          "description": "With new intel from Phobos Consultancy, Sierra must gather like-minded allies to strengthen the rebellion against Vextros.",
          "choices": [
            {
              "id": "recruit-tech-experts",
              "text": "Seek out tech experts to bolster the capabilities of The Open Blocks.",
              "requirements": {
                "expertise": 10
              },
              "attributes_gained": [
                {
                  "id": "tech-savvy-allies",
                  "type": "allies",
                  "description": "Form a coalition with skilled tech experts who can support strategic operations against Vextros.",
                  "stat_mods": {
                    "insight": 3
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "trust": 2
              },
              "next_situation_id": "strategic-planning",
              "internal_hint": "Focus on bolstering The Open Blocks with technical expertise.",
              "internal_justification": "This choice amps up Sierra's strategic advantage by acquiring skilled allies, allowing for more complex operations against Vextros."
            },
            {
              "id": "appeal-to-open-blocks",
              "text": "Convince The Open Blocks to synchronize their efforts for maximum impact.",
              "requirements": {
                "station": 8
              },
              "attributes_gained": [
                {
                  "id": "open-blocks-alliance",
                  "type": "allies",
                  "description": "Forge a deeper alliance with The Open Blocks, aligning their efforts with Sierra's cause.",
                  "stat_mods": {
                    "celebrity": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "influence": 2
              },
              "next_situation_id": "coordinated-action",
              "internal_hint": "Enhances player influence by leveraging anti-corporate factions.",
              "internal_justification": "Empowering The Open Blocks synchronizes efforts, potentially striking a significant blow against Vextros."
            },
            {
              "id": "secure-resources",
              "text": "Use black market connections to secure resources for the rebellion.",
              "requirements": {
                "savvy": 9
              },
              "attributes_gained": [
                {
                  "id": "black-market-resources",
                  "type": "resources",
                  "description": "Obtain vital equipment and materials, boosting the rebellion's capabilities.",
                  "stat_mods": {
                    "opulence": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "economy": 1
              },
              "next_situation_id": "resource-management",
              "internal_hint": "Emphasize resource acquisition for rebellion efforts.",
              "internal_justification": "Securing resources directly empowers Sierra's efforts, crucial for sustaining long-term opposition to Vextros."
            }
          ],
          "stat_requirements": {},
          "attribute_requirements": null,
          "consequences": {
            "alliance": "Strengthens the anti-corporate movement’s cohesiveness and strategic capabilities.",
            "resources": "Improves operational readiness for rebellion efforts.",
            "trust": "Builds confidence and trust among factions."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Strengthens the anti-corporate movement’s cohesiveness and strategic capabilities.",
            "Improves operational readiness for rebellion efforts.",
            "Builds confidence and trust among factions."
          ]
        },
        "demonstration": {
          "id": "demonstration",
          "title": "The nation stands on edge as Sierra leads a public occupation against Vextros’ visible oppression.",
          "description": "The nation stands on edge as Sierra leads a public occupation against Vextros’ visible oppression.",
          "choices": [
            {
              "id": "maintain-peaceful",
              "text": "Maintain a peaceful demonstration to convey a powerful message.",
              "requirements": {
                "integrity": 8
              },
              "attributes_gained": [
                {
                  "id": "peaceful-protest",
                  "type": "status",
                  "description": "Established as a peaceful leader, reinforcing moral authority.",
                  "stat_mods": {
                    "allure": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "society": 2
              },
              "next_situation_id": "public-response",
              "internal_hint": "Focus on non-violence and moral high ground.",
              "internal_justification": "Portraying Sierra as morally strong influences public perception positively, expanding the movement’s support."
            },
            {
              "id": "incite-action",
              "text": "Incite direct action to challenge corporate security presence.",
              "requirements": {
                "might": 10
              },
              "attributes_gained": [
                {
                  "id": "direct-action",
                  "type": "status",
                  "description": "Energized a section of the populace ready for direct confrontation.",
                  "stat_mods": {
                    "tenacity": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "violence": 5
              },
              "next_situation_id": "security-clash",
              "internal_hint": "Highlight Sierra's capacity for leadership in direct action.",
              "internal_justification": "Creates a dynamic narrative through conflict escalation that challenges Vextros’ power."
            },
            {
              "id": "public-speech",
              "text": "Deliver a compelling speech to expand the movement’s reach.",
              "requirements": {
                "allure": 9
              },
              "attributes_gained": [
                {
                  "id": "speaking-icon",
                  "type": "status",
                  "description": "Renowned for rallying speeches, drawing widespread support.",
                  "stat_mods": {
                    "celebrity": 3
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "popularity": 3
              },
              "next_situation_id": "network-expansion",
              "internal_hint": "Leverage charisma for broad societal influence.",
              "internal_justification": "Positions Sierra as a symbolic leader capable of inspiring massive followings."
            }
          ],
          "stat_requirements": {},
          "attribute_requirements": null,
          "consequences": {
            "moral-authority": "Demonstrates leadership's ethical stature, influencing factions.",
            "conflict": "Raises stakes by increasing tensions with security forces.",
            "inspiration": "Broadens influence and strengthens the movement’s appeal."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Demonstrates leadership's ethical stature, influencing factions.",
            "Raises stakes by increasing tensions with security forces.",
            "Broadens influence and strengthens the movement’s appeal."
          ]
        }
      },
      "bridge_nodes": [
        "root-situation-001",
        "gather-allies",
        "demonstration"
      ]
    },
    {
      "id": "Echoes of the Underground Rebellion",
      "situations": {
        "rootsituation001": {
          "id": "rootsituation001",
          "title": "In the labyrinthine depths of The Akropolis, the air is tense with the murmur of dissent. Sierra Violet finds herself drawn into a secret gathering, where whispers of rebellion against the authoritarian regime echo through the chambers. Here, a contact from the Phobos Consultancy clandestinely approaches her with a proposal – join forces with a burgeoning insurgency to dismantle Vextros's influence and liberate the oppressed citizens. As the shadows sway with each decision, Sierra must decide her path. Will she bolster the rebellion, manipulate it to her advantage, or attempt to quash it from within?",
          "description": "In the labyrinthine depths of The Akropolis, the air is tense with the murmur of dissent. Sierra Violet finds herself drawn into a secret gathering, where whispers of rebellion against the authoritarian regime echo through the chambers. Here, a contact from the Phobos Consultancy clandestinely approaches her with a proposal – join forces with a burgeoning insurgency to dismantle Vextros's influence and liberate the oppressed citizens. As the shadows sway with each decision, Sierra must decide her path. Will she bolster the rebellion, manipulate it to her advantage, or attempt to quash it from within?",
          "choices": [
            {
              "id": "choice001",
              "text": "Join the rebellion and join forces with the Phobos Consultancy to overthrow Vextros.",
              "requirements": {
                "integrity": 9
              },
              "attributes_gained": [
                {
                  "id": "allyphobos",
                  "type": "ally",
                  "description": "Alliance with Phobos Consultancy.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "tenacity": 2
              },
              "next_situation_id": "branch001_join",
              "internal_hint": "Sierra's grudge and latent integrity-driven motive align with open rebellion.",
              "internal_justification": "This choice leverages Sierra's vendetta against Vextros, allowing her to side with the rebellion and support her inherent tenacity and integrity."
            },
            {
              "id": "choice002",
              "text": "Manipulate the rebellion for your own gain, potentially setting yourself up as a new power player.",
              "requirements": {
                "savvy": 9
              },
              "attributes_gained": [
                {
                  "id": "grifter",
                  "type": "trait",
                  "description": "Manipulator of the rebellion.",
                  "stat_mods": {
                    "station": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "opulence": 2
              },
              "next_situation_id": "branch002_manipulate",
              "internal_hint": "Sierra's high savvy allows for strategic manipulation, aligning with her rebellious, anti-authority nature.",
              "internal_justification": "This choice highlights Sierra's potential to rise as a key manipulator, capitalizing on her background and grudge to achieve personal gain."
            },
            {
              "id": "choice003",
              "text": "Dismantle the rebellion from within, seeing it as an opportunity to destabilize Vextros's enemies.",
              "requirements": {
                "insight": 9
              },
              "attributes_gained": [
                {
                  "id": "vextrosspy",
                  "type": "trait",
                  "description": "Undercover operative against the rebellion.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "destiny": 1
              },
              "next_situation_id": "branch003_dismantle",
              "internal_hint": "Her insight offers a clandestine avenue to counter the rebellion, leveraging her resentment toward Vextros to resolve internal conflicts.",
              "internal_justification": "This choice allows Sierra to pivot her overarching goals, using her situation and acumen to destabilize perceived threats to her vendetta-driven objectives."
            }
          ],
          "stat_requirements": {},
          "attribute_requirements": null,
          "consequences": {
            "allyphobos": "Sierra gains new allies through Phobos Consultancy.",
            "grifter": "Sierra starts to harness political power through manipulation.",
            "vextrosspy": "Sierra undermines rebellion efforts, strengthening Vextros from the shadows."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Sierra gains new allies through Phobos Consultancy.",
            "Sierra starts to harness political power through manipulation.",
            "Sierra undermines rebellion efforts, strengthening Vextros from the shadows."
          ]
        },
        "branch001_join": {
          "id": "branch001_join",
          "title": "With the alliance formed with Phobos Consultancy, Sierra embarks on a mission to infiltrate a key Vextros facility deep underground. The mission is perilous, and the facility houses advanced technology that could bolster the rebellion's efforts or sow unspeakable chaos.",
          "description": "With the alliance formed with Phobos Consultancy, Sierra embarks on a mission to infiltrate a key Vextros facility deep underground. The mission is perilous, and the facility houses advanced technology that could bolster the rebellion's efforts or sow unspeakable chaos.",
          "choices": [
            {
              "id": "choice004",
              "text": "Use your skills to hack into the mainframe and retrieve critical data on Vextros's operations.",
              "requirements": {
                "expertise": 8
              },
              "attributes_gained": [
                {
                  "id": "datagineer",
                  "type": "trait",
                  "description": "Gained proficiency in data retrieval.",
                  "stat_mods": {
                    "integrity": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "savvy": 1
              },
              "next_situation_id": "sub_branch001_victory",
              "internal_hint": "Highlight Sierra's technical expertise.",
              "internal_justification": "This allows Sierra to leverage her technical skills as a means to contribute actively to the rebellion, showcasing her value and shifting power dynamics."
            },
            {
              "id": "choice005",
              "text": "Plant false information to mislead Vextros and create chaos within their ranks.",
              "requirements": {
                "insight": 9
              },
              "attributes_gained": [
                {
                  "id": "mindbender",
                  "type": "trait",
                  "description": "Expert at psychological manipulation and misinformation.",
                  "stat_mods": {
                    "celebrity": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "nimbility": 1
              },
              "next_situation_id": "sub_branch002_misinformation",
              "internal_hint": "Leverage her strategic insight.",
              "internal_justification": "This showcases Sierra's cunning, offering layers of complexity to her character and expanding narrative options for future scenarios."
            }
          ],
          "stat_requirements": {
            "integrity": 10
          },
          "attribute_requirements": null,
          "consequences": {
            "datagineer": "Sierra becomes an integral operative for the rebellion due to her data skills.",
            "mindbender": "Sierra sows discord in Vextros, destabilizing corporate endeavors."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Sierra becomes an integral operative for the rebellion due to her data skills.",
            "Sierra sows discord in Vextros, destabilizing corporate endeavors."
          ]
        },
        "branch002_manipulate": {
          "id": "branch002_manipulate",
          "title": "Sierra has established herself as a key manipulator within the rebellion. Now, she must decide how to leverage her influence in the burgeoning power vacuum resulting from Vextros's weakened grasp.",
          "description": "Sierra has established herself as a key manipulator within the rebellion. Now, she must decide how to leverage her influence in the burgeoning power vacuum resulting from Vextros's weakened grasp.",
          "choices": [
            {
              "id": "choice006",
              "text": "Form a splinter group and assert command, aiming to reshape the rebellion's objectives to prioritize your interests.",
              "requirements": {
                "opulence": 8
              },
              "attributes_gained": [
                {
                  "id": "leader",
                  "type": "title",
                  "description": "Leader of a splinter faction.",
                  "stat_mods": {
                    "station": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "tenacity": 1
              },
              "next_situation_id": "sub_branch003_faction_leader",
              "internal_hint": "Assert Sierra's dominance.",
              "internal_justification": "This choice gives Sierra the opportunity to directly lead and shape the rebellion, testing her leadership and conflict resolution skills."
            },
            {
              "id": "choice007",
              "text": "Remain in the shadows, using your covert connections to bolster your personal wealth and influence.",
              "requirements": {
                "station": 8
              },
              "attributes_gained": [
                {
                  "id": "shadowbroker",
                  "type": "title",
                  "description": "Master of secret dealings and influence.",
                  "stat_mods": {
                    "opulence": 2
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "destiny": 1
              },
              "next_situation_id": "sub_branch004_shadow_trade",
              "internal_hint": "Cultivate Sierra's behind-the-scenes power.",
              "internal_justification": "Keeps options open for intrigue and mystery, allowing the player to engage in tactics best suited for Sierra's high-savvy and insight."
            }
          ],
          "stat_requirements": {
            "savvy": 9
          },
          "attribute_requirements": null,
          "consequences": {
            "leader": "Sierra directly shapes the future of the rebellion as a leader.",
            "shadowbroker": "Sierra amasses influence, becoming a feared and respected figure in the black market."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Sierra directly shapes the future of the rebellion as a leader.",
            "Sierra amasses influence, becoming a feared and respected figure in the black market."
          ]
        },
        "branch003_dismantle": {
          "id": "branch003_dismantle",
          "title": "As an undercover operative, Sierra must navigate the rebellious landscape while feeding crucial intelligence back to Vextros. Her actions could swiftly turn the tide by crushing rebellion hotspots.",
          "description": "As an undercover operative, Sierra must navigate the rebellious landscape while feeding crucial intelligence back to Vextros. Her actions could swiftly turn the tide by crushing rebellion hotspots.",
          "choices": [
            {
              "id": "choice008",
              "text": "Sabotage a major rebellion offensive, ensuring the downfall of a key insurgent leader.",
              "requirements": {
                "insight": 10
              },
              "attributes_gained": [
                {
                  "id": "saboteur",
                  "type": "trait",
                  "description": "Master of sabotage and deception.",
                  "stat_mods": {
                    "integrity": -1,
                    "celebrity": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "might": 1
              },
              "next_situation_id": "sub_branch005_sabotage",
              "internal_hint": "Highlight Sierra's insights for sabotage.",
              "internal_justification": "To maximize intelligence and disrupt the opposition, focusing on aspects of deception and strategy fitting with Sierra's overarching objective."
            },
            {
              "id": "choice009",
              "text": "Leak misinformation to diminish the rebels' public support, turning the populace against them.",
              "requirements": {
                "insight": 9
              },
              "attributes_gained": [
                {
                  "id": "strategist",
                  "type": "trait",
                  "description": "Expert in psychological warfare.",
                  "stat_mods": {
                    "integrity": 1
                  }
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "savvy": 1
              },
              "next_situation_id": "sub_branch006_mislead",
              "internal_hint": "Use Sierra’s expertise in manipulation and propaganda.",
              "internal_justification": "Offensive strategies aimed at undermining rebellion legitimacy fit Sierra's narrative path of subversion and chaos."
            }
          ],
          "stat_requirements": {
            "insight": 9
          },
          "attribute_requirements": null,
          "consequences": {
            "saboteur": "Sierra successfully disrupts rebel efforts, destabilizing opposition power.",
            "strategist": "Sierra's tactics shift public opinion, deteriorating rebel support."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Sierra successfully disrupts rebel efforts, destabilizing opposition power.",
            "Sierra's tactics shift public opinion, deteriorating rebel support."
          ]
        }
      },
      "bridge_nodes": [
        "rootsituation001",
        "branch001_join",
        "branch002_manipulate",
        "branch003_dismantle"
      ]
    },
    {
      "id": "Radiant Shadows in a Dying City: The Rebellion of Sierra Violet",
      "situations": {
        "beginning_of_the_rebellion": {
          "id": "beginning_of_the_rebellion",
          "title": "Sierra Violet stands at the edge of the Crescent Center's Level 10 Atrium, where the affluent overlook the struggles below. Fueled by her grudge against Vextros, she contemplates her next move. The Open Blocks have reached out, offering a chance to strike a blow against the corporation that holds the city in a vice-like grip. Meanwhile, rumors of Project Sunset's experiments in The Lower Quarter might hold the key to overthrowing the current regime. Yet Sierra knows that dealing with Phobos's authoritarian tendencies will require tact and resolve.",
          "description": "Sierra Violet stands at the edge of the Crescent Center's Level 10 Atrium, where the affluent overlook the struggles below. Fueled by her grudge against Vextros, she contemplates her next move. The Open Blocks have reached out, offering a chance to strike a blow against the corporation that holds the city in a vice-like grip. Meanwhile, rumors of Project Sunset's experiments in The Lower Quarter might hold the key to overthrowing the current regime. Yet Sierra knows that dealing with Phobos's authoritarian tendencies will require tact and resolve.",
          "choices": [
            {
              "id": "join_open_blocks",
              "text": "Accept The Open Blocks' offer to join their ranks and coordinate your first strike against Vextros.",
              "requirements": {
                "integrity": 6
              },
              "attributes_gained": [
                {
                  "id": "open_blocks_alliance",
                  "type": "status",
                  "description": "An alliance with The Open Blocks, granting access to their resources and network.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "tenacity": 2
              },
              "next_situation_id": "plan_the_attack",
              "internal_hint": "Allow Sierra to build a strong foundation with The Open Blocks for future collaborations.",
              "internal_justification": "This choice strengthens Sierra's position by aligning with a group that shares her goals, increasing her influence and resource access for her rebellion."
            },
            {
              "id": "investigate_project_sunset",
              "text": "Head to The Lower Quarter to uncover the secrets of Project Sunset's experiments.",
              "requirements": {
                "savvy": 7
              },
              "attributes_gained": [
                {
                  "id": "knowledge_of_sunset",
                  "type": "knowledge",
                  "description": "Insights into Project Sunset's experiments and their potential impact on Libertas.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "insight": 3
              },
              "next_situation_id": "unraveling_secrets",
              "internal_hint": "Direct Sierra towards uncovering the mysterious factors that could tip the balance of power.",
              "internal_justification": "By choosing to investigate Project Sunset, Sierra gains crucial information that may provide leverage against Vextros, advancing her goals."
            },
            {
              "id": "challenge_phobos_authority",
              "text": "Approach Phobos Consultancy to negotiate a covert alliance or peace treaty.",
              "requirements": {
                "celebrity": 5
              },
              "attributes_gained": [
                {
                  "id": "phobos_negotiator",
                  "type": "status",
                  "description": "Recognition as a diplomat capable of swaying Phobos Consultancy's decisions.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "allure": 2
              },
              "next_situation_id": "diplomatic_maneuvers",
              "internal_hint": "Focus on diversifying Sierra's alliances, making her harder to counter politically.",
              "internal_justification": "Forming a covert understanding with Phobos may neutralize one facet of opposition, giving her more freedom of movement against Vextros."
            }
          ],
          "stat_requirements": {},
          "attribute_requirements": null,
          "consequences": {
            "Vextros_discomfort": "Vextros feels the pressure of mounting resistance across multiple fronts, prompting heightened security measures."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Vextros feels the pressure of mounting resistance across multiple fronts, prompting heightened security measures."
          ]
        },
        "plan_the_attack": {
          "id": "plan_the_attack",
          "title": "After aligning with The Open Blocks, Sierra meets with key members in a secret underground chamber within the Crescent Center. Together, they plot a simultaneous series of attacks on key Vextros facilities to disrupt their operations and send a powerful message of resistance.",
          "description": "After aligning with The Open Blocks, Sierra meets with key members in a secret underground chamber within the Crescent Center. Together, they plot a simultaneous series of attacks on key Vextros facilities to disrupt their operations and send a powerful message of resistance.",
          "choices": [
            {
              "id": "target_comms",
              "text": "Focus on disabling Vextros's communication network to confuse and delay their response.",
              "requirements": {
                "insight": 8
              },
              "attributes_gained": [
                {
                  "id": "comms_expert",
                  "type": "status",
                  "description": "Acknowledged as a specialist in corporate disruption tactics.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "savvy": 2
              },
              "next_situation_id": "execute_attack_comms",
              "internal_hint": "Permit Sierra to demonstrate strategic prowess and gain tactical advantages.",
              "internal_justification": "Targeting communications allows Sierra to show initiative and gain a reputation that will be useful for future endeavors against Vextros."
            },
            {
              "id": "target_supply",
              "text": "Intercept supply lines to starve the Vextros facilities of crucial resources.",
              "requirements": {
                "nimbleness": 7
              },
              "attributes_gained": [
                {
                  "id": "logistics_master",
                  "type": "status",
                  "description": "Mastered the art of supply chain disruption.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "tenacity": 1
              },
              "next_situation_id": "execute_attack_supply",
              "internal_hint": "Push Sierra towards leveraging logistics for higher strategic impact.",
              "internal_justification": "By disrupting supply lines, Sierra gains credibility and puts practical pressure on Vextros, causing ripple effects on their operations."
            }
          ],
          "stat_requirements": {
            "integrity": 7
          },
          "attribute_requirements": null,
          "consequences": {
            "open_blocks_boost": "The Open Blocks are emboldened by the successful planning session, attracting more recruits and increasing their influence."
          },
          "is_bridge_node": true,
          "next_situations": [
            "The Open Blocks are emboldened by the successful planning session, attracting more recruits and increasing their influence."
          ]
        },
        "unraveling_secrets": {
          "id": "unraveling_secrets",
          "title": "Sierra discovers a disturbing truth about Project Sunset's experiments; they are aimed at creating AI capable of unprecedented influence over human cognition.",
          "description": "Sierra discovers a disturbing truth about Project Sunset's experiments; they are aimed at creating AI capable of unprecedented influence over human cognition.",
          "choices": [
            {
              "id": "leak_to_public",
              "text": "Leak the information to the public to spread awareness and incite panic against Vextros.",
              "requirements": {
                "celebrity": 6
              },
              "attributes_gained": [
                {
                  "id": "whistleblower",
                  "type": "status",
                  "description": "Respected as a fearless exposer of corporate fraud.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "integrity": 2
              },
              "next_situation_id": "public_reaction",
              "internal_hint": "Capitalize on Sierra's charisma to destabilize Vextros's public image further.",
              "internal_justification": "By going public, Sierra not only inherits public favor but also weakens Vextros's grip by turning society against them."
            },
            {
              "id": "keep_hidden",
              "text": "Keep the information concealed to use as a bargaining chip in negotiations.",
              "requirements": {
                "savvy": 9
              },
              "attributes_gained": [
                {
                  "id": "master_strategist",
                  "type": "status",
                  "description": "Proficient in the art of negotiation and leverage.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "insight": 2
              },
              "next_situation_id": "corporate_negotiations",
              "internal_hint": "Develop Sierra as a tactical thinker who uses information as negotiation power.",
              "internal_justification": "Keeping the information hidden prepares Sierra for delicate negotiations, providing an upper hand in potential alliances or conflicts."
            }
          ],
          "stat_requirements": {
            "insight": 8
          },
          "attribute_requirements": null,
          "consequences": {
            "sunset_research_blown": "Project Sunset faces scrutiny and possible sabotage, leading to setbacks in their research."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Project Sunset faces scrutiny and possible sabotage, leading to setbacks in their research."
          ]
        },
        "diplomatic_maneuvers": {
          "id": "diplomatic_maneuvers",
          "title": "With newfound recognition as a negotiator, Sierra is invited to a clandestine meeting with a Phobos Consultancy representative, offering an opportunity to form an unexpected alliance against Vextros.",
          "description": "With newfound recognition as a negotiator, Sierra is invited to a clandestine meeting with a Phobos Consultancy representative, offering an opportunity to form an unexpected alliance against Vextros.",
          "choices": [
            {
              "id": "accept_alliance",
              "text": "Form a pact with Phobos, agreeing to mutually beneficial terms for fighting Vextros.",
              "requirements": {
                "celebrity": 7
              },
              "attributes_gained": [
                {
                  "id": "phobos_ally",
                  "type": "status",
                  "description": "Secured a tactical alliance with Phobos, granting access to their unique resources.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "station": 2
              },
              "next_situation_id": "joint_operations",
              "internal_hint": "Integrate Sierra's diplomacy by forging a complex political alliance.",
              "internal_justification": "An alliance with Phobos would be unorthodox yet strategically advantageous, complicating the network of power relations in Sierra's favor and opening new pathways for rebellion."
            },
            {
              "id": "decline_offer",
              "text": "Politely decline the alliance, maintaining independence from Phobos's authoritarian ideology.",
              "requirements": {
                "integrity": 9
              },
              "attributes_gained": [
                {
                  "id": "principled_leader",
                  "type": "status",
                  "description": "Reputation as a principled leader who doesn't compromise core values.",
                  "stat_mods": null
                }
              ],
              "attributes_lost": [],
              "stat_changes": {
                "allure": 1
              },
              "next_situation_id": "strategic_independence",
              "internal_hint": "Reinforce Sierra’s independence and eschewing alliances that oppose her ideals.",
              "internal_justification": "Declining the offer strengthens Sierra’s resolve and moral positioning in the rebellion, favoring alliances that align more closely with her principles later in the arc."
            }
          ],
          "stat_requirements": {
            "celebrity": 6
          },
          "attribute_requirements": null,
          "consequences": {
            "phobos_involvement": "Phobos becomes more actively engaged in the political scene due to Sierra's tactical maneuvers, impacting future conflicts."
          },
          "is_bridge_node": true,
          "next_situations": [
            "Phobos becomes more actively engaged in the political scene due to Sierra's tactical maneuvers, impacting future conflicts."
          ]
        }
      },
      "bridge_nodes": [
        "beginning_of_the_rebellion",
        "plan_the_attack",
        "unraveling_secrets",
        "diplomatic_maneuvers"
      ]
    }
  ]
}