{
  "situations": {
    "root_echoes_beneath_akropolis_001": {
      "id": "root_echoes_beneath_akropolis_001",
      "title": "In the dimly lit underpass near one of The Akropolis' selection chambers, Sierra Violet encounters a jittery informant, a low-ranking member of Phobos Consultancy. The air reeks of damp stone and metallic tension as the informant beckons Sierra closer, whispering about the rigged nature of the brutal selection tests. Suddenly, footsteps echo—military enforcers are patrolling the area, their gaze sharp and unforgiving. Sierra must navigate this precarious moment: engage the informant, evade the patrol, or seize an opportunity for a discreet questioning.",
      "description": "In the dimly lit underpass near one of The Akropolis' selection chambers, Sierra Violet encounters a jittery informant, a low-ranking member of Phobos Consultancy. The air reeks of damp stone and metallic tension as the informant beckons Sierra closer, whispering about the rigged nature of the brutal selection tests. Suddenly, footsteps echo—military enforcers are patrolling the area, their gaze sharp and unforgiving. Sierra must navigate this precarious moment: engage the informant, evade the patrol, or seize an opportunity for a discreet questioning.",
      "choices": [
        {
          "id": "choice_ask_for_details",
          "text": "Press the informant for specifics about the rigged selection tests.",
          "dialogue_response": "I need to know exactly how they're manipulating the selection. Tell me everything, now.",
          "choice_type": "dialogue",
          "player_perspective": "You fix the informant with a hard stare, letting no room for evasion. Their eyes widen, and they begin divulging snippets of coded schedules and coercive tactics hidden beneath the surface trials.",
          "emotional_tone": "urgent and interrogative",
          "body_language": "Leaning in close, fists clenched at your sides, voice low but intense.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "info_selection_rigged",
              "type": "status",
              "description": "Gained knowledge about the rigged nature of the selection tests.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {},
          "next_situation_id": "intel_debrief_akropolis_002",
          "internal_hint": "Initiate detailed intel gathering to deepen understanding of Phobos Consultancy's manipulation.",
          "internal_justification": "Directs player to uncover crucial plot details early, advancing the conspiracy narrative and enabling deeper immersion."
        },
        {
          "id": "choice_silently_withdraw",
          "text": "Disappear silently into the tunnels, avoiding confrontation and the approaching patrol.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You gesture subtly at the informant to stay quiet and slip back into the maze of shadows. The patrol's heavy footsteps grow louder, but you melt into the darkness, heart pounding yet unseen.",
          "emotional_tone": "cautious and evasive",
          "body_language": "Eyes scanning exits, body pressed low against the damp walls, breathing shallow.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "nimbleness": 1
          },
          "next_situation_id": "tunnel_escape_akropolis_003",
          "internal_hint": "Encourages stealth and survival tactics when confronted by immediate threats.",
          "internal_justification": "Provides alternative approach emphasizing the player's urgency and prudence in a hostile environment."
        },
        {
          "id": "choice_alert_patrol",
          "text": "Deliberately distract or provoke the patrol to create chaos and cover the informant's escape.",
          "dialogue_response": "Hey! Over here! You think you can hide secrets from us?",
          "choice_type": "dialogue",
          "player_perspective": "Your voice rings out, sharp and loud, drawing the patrol's attention away from the informant. They jerk weapons free, scanning for the source. The informant melts away in the confusion, but now you’re in the spotlight.",
          "emotional_tone": "bold and confrontational",
          "body_language": "Stepping into the scant light, fists raised slightly, posture aggressive.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "spotlight",
              "type": "status",
              "description": "Marked by Akropolis enforcers as a person of interest.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "might": 1
          },
          "next_situation_id": "enforcer_confrontation_akropolis_004",
          "internal_hint": "Creates immediate conflict and attention on the player, raising stakes.",
          "internal_justification": "Drives tension and forces players into risky social confrontations, aligning with arc tone."
        },
        {
          "id": "choice_question_informant_about_vextros",
          "text": "Shift the questioning to how Vextros might be connected to these underground machinations.",
          "dialogue_response": "What’s Vextros got to do with this? I have a score to settle.",
          "choice_type": "dialogue",
          "player_perspective": "Your voice hardens mentioning Vextros. The informant shivers visibly. \"They pull strings too,\" they whisper, \"but that’s a different beast. Dangerous to talk about.\"",
          "emotional_tone": "determined and personal",
          "body_language": "Narrowed eyes, jaw clenched, posture steadfast.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [
            {
              "id": "info_vextros_shadow",
              "type": "status",
              "description": "Gained knowledge of Vextros' shadow influence in Akropolis.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "intel_vextros_connection_005",
          "internal_hint": "Utilizes player's personal grudge to introduce deeper faction interplay.",
          "internal_justification": "Weaves personal vendetta into broader plot, enriching character agency and faction complexity."
        },
        {
          "id": "choice_lean_back_skeptical",
          "text": "Respond with skepticism, studying the informant’s nervous ticks to gauge truthfulness.",
          "dialogue_response": "You're hiding something. What aren’t you telling me about the selection?",
          "choice_type": "dialogue",
          "player_perspective": "You lean back slightly, eyebrows furrowed, eyes flicking to the informant's twitching fingers and darting gaze. Your tone is cold but probing, challenging their half-truths.",
          "emotional_tone": "skeptical and probing",
          "body_language": "Crossing arms loosely, maintaining sharp eye contact, lips pursed.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "intel_debrief_akropolis_002",
          "internal_hint": "Introduces a probing, mistrusting player approach to enhance investigative depth.",
          "internal_justification": "Encourages player to read micro-expressions and get better intel from NPCs, adding nuance to info gathering."
        },
        {
          "id": "choice_quiet_gesture_reassure",
          "text": "Place a finger over your lips and gesture to remain silent, focusing on calming the informant.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You raise a finger softly to your lips, signaling for quiet, your voice dropped to a whisper as you exude calm confidence. The informant's tension eases ever so slightly, glancing at the shadows for danger.",
          "emotional_tone": "calm and reassuring",
          "body_language": "Slow breathing, relaxed hands unclenched, steady gaze.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {},
          "next_situation_id": "quiet_wait_akropolis_006",
          "internal_hint": "Non-verbal reassurance to lower NPC fear and possibly open safer dialogue windows.",
          "internal_justification": "Strengthens player-informant rapport and introduces varied communication styles."
        },
        {
          "id": "choice_interrupt_patrol_whisper",
          "text": "Interrupt to warn informant in a low whisper about the approaching patrol's numbers and formation.",
          "dialogue_response": "They’re close, at least six. Two front, four tail. Stay sharp.",
          "choice_type": "dialogue",
          "player_perspective": "You cut in softly, words carefully measured as you outline the patrol’s approach. The informant's eyes widen, nodding in urgent understanding, tightening their grip on the information they carry.",
          "emotional_tone": "steely and alert",
          "body_language": "Eyes sharp, voice barely above breath, poised for rapid movement.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "info_patrol_warning",
              "type": "status",
              "description": "Increased preparedness from informant and player regarding patrol dynamics.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "stall_for_time_akropolis_007",
          "internal_hint": "Micro-action that changes dynamics of NPC behavior during imminent threat.",
          "internal_justification": "Allows player to use observational skills actively, impacting narrative pacing and options."
        },
        {
          "id": "choice_probe_informant_emotion",
          "text": "Notice the informant’s fear and hesitation; gently ask what scares them most about the tests.",
          "dialogue_response": "You seem afraid. What’s the worst part of all this for you?",
          "choice_type": "dialogue",
          "player_perspective": "Softening your tone, you catch the flicker of dread crossing the informant’s face. They swallow hard and whisper about betrayals and broken promises, revealing hidden personal stakes.",
          "emotional_tone": "empathetic and curious",
          "body_language": "Soft eyes, leaning in slightly, hands open and relaxed.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "intel_emotional_akropolis_008",
          "internal_hint": "Builds emotional connection and uncovers humanizing details about NPC motivations.",
          "internal_justification": "Enhances narrative richness by exploring personal stakes behind faction machinations."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {
        "info_vextros_shadow": "Complicates player's path with intertwined faction politics.",
        "nimbleness": "Grants increased chance to evade patrols or navigate tunnels.",
        "spotlight": "Raises difficulty for stealth, potential for enforcer confrontations.",
        "intel_selection_rigged": "Unlocks deeper plot threads about Phobos Consultancy's manipulation of selection tests."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Complicates player's path with intertwined faction politics.",
        "Grants increased chance to evade patrols or navigate tunnels.",
        "Raises difficulty for stealth, potential for enforcer confrontations.",
        "Unlocks deeper plot threads about Phobos Consultancy's manipulation of selection tests."
      ]
    },
    "informant_whispers_rigged_001": {
      "id": "informant_whispers_rigged_001",
      "title": "The informant leans in, voice low and urgent. \"They don’t just rig the results—they set impossible traps to weed out anyone they don’t want surviving. It’s all about control, Sierra. Do you want the details?\" Their eyes flicker nervously toward the approaching patrol.",
      "description": "The informant leans in, voice low and urgent. \"They don’t just rig the results—they set impossible traps to weed out anyone they don’t want surviving. It’s all about control, Sierra. Do you want the details?\" Their eyes flicker nervously toward the approaching patrol.",
      "choices": [
        {
          "id": "choice_insist_more_details",
          "text": "Press for specifics on the traps and how they manipulate outcomes.",
          "dialogue_response": "\"What kind of traps? How exactly do they decide who fails?\"",
          "choice_type": "dialogue",
          "player_perspective": "Your gaze sharpens as you demand clarity. The informant swallows, sweat gleaming on their brow before beginning a halting explanation of hidden sensors, false data, and impossible physical demands.",
          "emotional_tone": "urgent and interrogative",
          "body_language": "Leaning forward, fists clenched slightly, eyes locked on theirs.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "info_selection_traps",
              "type": "status",
              "description": "Learned about the brutal pitfalls engineered into the selection tests.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_reacts_enforcers_002",
          "internal_hint": "Follow up on informant’s information about rigged traps to deepen plot.",
          "internal_justification": "Focused dialogue choice emphasizes gathering complex intel to fuel later confrontations and player strategy."
        },
        {
          "id": "choice_show_empathy",
          "text": "Soften your tone and show understanding to build trust.",
          "dialogue_response": "\"Sounds brutal... I get why you’re scared. I’m on your side.\"",
          "choice_type": "dialogue",
          "player_perspective": "You let your voice lower, aiming to calm their jittery nerves. The informant's eyes flicker with a mix of relief and confusion, hesitant but willing to share more.",
          "emotional_tone": "empathetic and reassuring",
          "body_language": "Relaxed shoulders, gentle nod, open palms glimpsed briefly.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "trust_informant",
              "type": "status",
              "description": "Gained initial trust from the informant, enabling deeper cooperation.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_deepens_trust_003",
          "internal_hint": "Emphasizes relationship building through empathy before extracting more info.",
          "internal_justification": "Adds a softer narrative beat allowing alternative approaches to conflict and trust."
        },
        {
          "id": "choice_finger_tap_foreigners",
          "text": "Mention anti-outsider hostility to see if it affects the informant’s willingness.",
          "dialogue_response": "\"They hate us outsiders. Does that make your life harder?\"",
          "choice_type": "dialogue",
          "player_perspective": "You drop your voice to a conspiratorial whisper, gauging their response to the city’s grim prejudices. They glance quickly over their shoulder, then nod stiffly.",
          "emotional_tone": "probing and cautious",
          "body_language": "Eyes darting, slight head tilt suggesting curiosity and concern.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "informant_responds_hostility_004",
          "internal_hint": "Explores social tension layers influencing character loyalties and reveal biases.",
          "internal_justification": "Incorporates world-building through character insight and potential faction friction."
        },
        {
          "id": "choice_cut_them_off_firm",
          "text": "Interrupt firmly to steer conversation toward actionable intel.",
          "dialogue_response": "\"Enough fear. Give me the facts before those enforcers get here.\"",
          "choice_type": "dialogue",
          "player_perspective": "You cut them off with a sharp tone, eyes hard as you force them back on track. The informant flinches but nods quickly, words spilling in a hurried rush.",
          "emotional_tone": "directive and no-nonsense",
          "body_language": "Straight posture, narrowed eyes, cutting a sharp silhouette in the dim light.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "info_selection_traps_focused",
              "type": "status",
              "description": "Received focused, actionable details under pressure.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2,
            "tenacity": 1
          },
          "next_situation_id": "informant_rushed_reveal_005",
          "internal_hint": "Allows player to force information rapidly amid rising danger.",
          "internal_justification": "Adds a tension-focused choice that reflects player's decisiveness and pressure tactics."
        },
        {
          "id": "choice_flash_reassuring_smile",
          "text": "Flash a reassuring smile and subtly touch their arm to ease tension before they speak.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You offer a brief, warm smile and let your fingertips brush their forearm lightly. The informant's breath steadies, and their eyes soften, as if the shared moment momentarily dissolves the looming threat.",
          "emotional_tone": "gentle and calming",
          "body_language": "Soft eyes, brief light contact, gentle smile.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "trust_informant_physical",
              "type": "status",
              "description": "Established trust through comforting nonverbal cues.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "informant_deepens_trust_003",
          "internal_hint": "Facilitates trust using physical reassurance without speech.",
          "internal_justification": "Explores micro-interactions emphasizing emotional connection and trust-building."
        },
        {
          "id": "choice_sharpen_gaze_scan_room",
          "text": "Sharpen your gaze and subtly scan the surrounding cave for threats while listening.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You narrow your eyes, subtly scanning the jagged shadows and narrowing tunnels for any sign of the patrol. Your ears catch every scrape and whisper, preparing for a quick exit if needed while the informant speaks.",
          "emotional_tone": "alert and cautious",
          "body_language": "Steady breathing, precise eye movement, quick head tilts.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "alertness_cave_scan",
              "type": "status",
              "description": "Heightened awareness of environmental threats during tense exchange.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "nimbleness": 1
          },
          "next_situation_id": "informant_reacts_enforcers_002",
          "internal_hint": "Allows player to blend information gathering with environmental vigilance.",
          "internal_justification": "Adds depth to the player's situational awareness and tactical mindset."
        },
        {
          "id": "choice_internal_steeling_breath",
          "text": "Internally steel yourself with a deep breath, bracing for troubling information.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "You take a slow, deliberate breath, muscles tensing inwardly as you prepare to face whatever grim truths come next. Your jaw tightens, but your voice remains steady, ready to grasp every word.",
          "emotional_tone": "resolute and focused",
          "body_language": "Subtle chest rise with slow breath, tightened jaw.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "mental_preparedness",
              "type": "status",
              "description": "Improved composure in the face of anxiety-inducing information.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "informant_whispers_rigged_001",
          "internal_hint": "Represents internal mental preparation to better handle upcoming stress.",
          "internal_justification": "Adds internal emotional nuance allowing player to role-play resilience."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {
        "info_selection_traps": "Unfolds detailed rigging methods.",
        "trust_informant": "Unlocks alternative dialogue later.",
        "savvy": "Improves social calibration.",
        "info_selection_traps_focused": "Fast but pressured intel reveal.",
        "trust_informant_physical": "Establishes trust nonverbally.",
        "alertness_cave_scan": "Increases threat awareness.",
        "mental_preparedness": "Bolsters player composure."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Unfolds detailed rigging methods.",
        "Unlocks alternative dialogue later.",
        "Improves social calibration.",
        "Fast but pressured intel reveal.",
        "Establishes trust nonverbally.",
        "Increases threat awareness.",
        "Bolsters player composure."
      ]
    },
    "informant_reacts_enforcers_002": {
      "id": "informant_reacts_enforcers_002",
      "title": "Suddenly, the jagged echo of military boots reverberates nearby. The informant's pupils dilate as they freeze, whispering, \"They’re coming. What do we do?\" Their hand twitches toward a hidden pistol holster.",
      "description": "Suddenly, the jagged echo of military boots reverberates nearby. The informant's pupils dilate as they freeze, whispering, \"They’re coming. What do we do?\" Their hand twitches toward a hidden pistol holster.",
      "choices": [
        {
          "id": "choice_silently_signal_escape",
          "text": "Signal the informant to follow as you slip into the dark side tunnel.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You clutch at their sleeve with quick fingers, pulling them into the shadowed maw of an unlit tunnel. Your heart hammers as boots thunder past your hiding spot like monsters in a storm.",
          "emotional_tone": "urgent and stealthy",
          "body_language": "Swift hand gestures, tense crouch, quick shuffling steps.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "nimbleness": 1
          },
          "next_situation_id": "tunnel_escape_akropolis_003",
          "internal_hint": "Leads to stealth escape emphasizing agility and caution.",
          "internal_justification": "Offers a non-combat escape reinforcing player’s nimbleness and prudence."
        },
        {
          "id": "choice_draw_weapon_to_fight",
          "text": "Pull your weapon and prepare to defend the informant aggressively.",
          "dialogue_response": "\"Let them try. I’m not going down quietly.\"",
          "choice_type": "dialogue",
          "player_perspective": "You flick your fingers to ready your sidearm, muscles coiling. \"Stay behind me,\" you bark. The informant blinks rapidly, surprised, but backs away into the shadows cautiously.",
          "emotional_tone": "defiant and protective",
          "body_language": "Steely gaze, squared shoulders, weapon subtly drawn but ready.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "spotlight",
              "type": "status",
              "description": "Marked by Akropolis enforcers as a person of interest.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "might": 1
          },
          "next_situation_id": "enforcer_confrontation_akropolis_004",
          "internal_hint": "Triggers direct confrontation with enforcers raising tension.",
          "internal_justification": "Places player into immediate conflict to heighten stakes and test resolve."
        },
        {
          "id": "choice_hold_informant_back",
          "text": "Quietly hush the informant and gesture to stay hidden against the wall.",
          "dialogue_response": "\"Stay quiet. Let them pass. No sudden moves.\"",
          "choice_type": "dialogue",
          "player_perspective": "You grip their arm, pressing them against the stone wall, breath slow and controlled. The harsh light of flashlights scrapes past, missing your shadow by inches.",
          "emotional_tone": "cautious and protective",
          "body_language": "Finger pressed to lips, steady hands holding tightly but gently.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "nimbleness": 1
          },
          "next_situation_id": "tunnel_hideout_akropolis_005",
          "internal_hint": "Encourages stealth through freeze and hide mechanics.",
          "internal_justification": "Enables player to avoid confrontation through calm presence."
        },
        {
          "id": "choice_force_informant_to_silence",
          "text": "Place a finger firmly on the informant’s lips, fixing them with a warning stare.",
          "dialogue_response": "\"Not a sound. Your gun stays hidden, or we both die.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your eyes lock with theirs, no wavering tolerance. Your finger presses gently but firmly to their lips, silence spoken louder than words.",
          "emotional_tone": "stern and commanding",
          "body_language": "Direct eye contact, physical quieting gesture.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "tunnel_hideout_akropolis_005",
          "internal_hint": "Asserts control to maintain stealth and prevent panic.",
          "internal_justification": "Demonstrates leadership and quick thinking to keep situation contained."
        },
        {
          "id": "choice_whisper_reassure_informant",
          "text": "Place a comforting hand on the informant’s shoulder and whisper calm encouragement.",
          "dialogue_response": "\"We can get through this. Stay close and breathe with me.\"",
          "choice_type": "dialogue",
          "player_perspective": "You squeeze their shoulder reassuringly. Your voice drops low, a steady anchor amid the storm of approaching danger.",
          "emotional_tone": "calm and supportive",
          "body_language": "Soft touch, relaxed but alert posture.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "trust_informant",
              "type": "relationship",
              "description": "Strengthened trust between you and the informant.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "tunnel_hideout_akropolis_005",
          "internal_hint": "Builds trust to improve teamwork in tense moment.",
          "internal_justification": "Develops relationship dynamics while defusing panic."
        },
        {
          "id": "choice_scan_surroundings_quickly",
          "text": "Quickly scan the tunnel’s entrance for traps or surveillance devices.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your eyes flicker over the cracked stone and shadowy recesses, fingers lightly brushing for wires or lenses, heart racing against time.",
          "emotional_tone": "alert and methodical",
          "body_language": "Sharp, attentive movements with a careful gaze.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1
          },
          "next_situation_id": "informant_reacts_enforcers_002_scanned",
          "internal_hint": "Allows detection of immediate hazards or ambush points.",
          "internal_justification": "Encourages active scene awareness adding variety to response options."
        },
        {
          "id": "choice_interrupt_informant_panic",
          "text": "Cut off the informant’s rising panic with a low, firm whisper.",
          "dialogue_response": "\"No time. Focus on my voice, not your fear.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice is a steel blade against the chaos, grounding both your breath and theirs. They nod, struggling to control trembling hands.",
          "emotional_tone": "firm and grounding",
          "body_language": "Steady stance, intense eye contact.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "informant_reacts_enforcers_002",
          "internal_hint": "Redirects panic into quiet compliance.",
          "internal_justification": "Shows psychological command and quick thinking to maintain control."
        },
        {
          "id": "choice_express_doubt_about_informant_gun",
          "text": "Sharply whisper a warning about the informant’s hidden pistol.",
          "dialogue_response": "\"That gun’s a liability right now. Can you really trust it?\"",
          "choice_type": "dialogue",
          "player_perspective": "Your words hit their ears like cold water, eyes narrowing slightly to read their reaction, capturing moments that betray hesitation or resolve.",
          "emotional_tone": "skeptical and probing",
          "body_language": "Lean forward, subtle head tilt.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "informant_reacts_enforcers_002",
          "internal_hint": "Tests informant’s resolve and readiness for confrontation.",
          "internal_justification": "Introduces tension in their dynamic, sets stage for decisions about violence or stealth."
        }
      ],
      "stat_requirements": {
        "info_selection_traps": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "spotlight": "Elevated danger from patrols.",
        "nimbleness": "Increased stealth effectiveness.",
        "trust_informant": "Improved cooperation and reliability with informant."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Elevated danger from patrols.",
        "Increased stealth effectiveness.",
        "Improved cooperation and reliability with informant."
      ]
    },
    "intel_vextros_connection_005": {
      "id": "intel_vextros_connection_005",
      "title": "The informant shivers as you mention Vextros. \"They’re the puppetmasters behind the curtain, but the Akropolis won’t admit it openly. Vextros uses the selection to keep their hands clean, but profits from both winners and losers—feeding on the desperation underground.\" Their voice cracks with fear and accusation.",
      "description": "The informant shivers as you mention Vextros. \"They’re the puppetmasters behind the curtain, but the Akropolis won’t admit it openly. Vextros uses the selection to keep their hands clean, but profits from both winners and losers—feeding on the desperation underground.\" Their voice cracks with fear and accusation.",
      "choices": [
        {
          "id": "choice_probe_vextros_lust_potency",
          "text": "Press the informant on Vextros’ profits and motivations.",
          "dialogue_response": "\"How exactly does Vextros profit from the selection? What do they gain?\"",
          "choice_type": "dialogue",
          "player_perspective": "Your questions cut through the tension, seeking facts to bolster your vendetta. The informant exhales heavily, revealing how Vextros controls medical supplies, tech, and information trafficking tied to the selection survivors.",
          "emotional_tone": "investigative and determined",
          "body_language": "Steady eye contact, hands folded in front, thoughtful expression.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [
            {
              "id": "info_vextros_motives",
              "type": "status",
              "description": "Gained concrete knowledge of Vextros' corrupt exploitation of the selection process.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_warning_vextros_006",
          "internal_hint": "Deepen player’s understanding of Vextros' exploitation connecting to grudge.",
          "internal_justification": "Creates overlap between player personal stakes and wider conspiracy."
        },
        {
          "id": "choice_challenge_informant_fear",
          "text": "Question the informant's fear — is it paranoia or truth?",
          "dialogue_response": "\"Are you sure this isn't just paranoia? What proof do you have?\"",
          "choice_type": "dialogue",
          "player_perspective": "You press firmly, studying their reaction. Their eyes flash angrily, then weary resignation. \"Proof’s hard to come by in here,\" they spit, voice bitter. \"But look around—do you see anyone walking free who’s not bought or broken?\"",
          "emotional_tone": "skeptical and challenging",
          "body_language": "Arms crossed, head tilted slightly, brow furrowed.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "informant_gives_partial_proof_007",
          "internal_hint": "Tests reliability of informant and player's critical thinking.",
          "internal_justification": "Introduces narrative tension over trustworthiness and paranoia in conspiracies."
        },
        {
          "id": "choice_show_solidarity_vextros",
          "text": "Express your personal grudge openly to rally the informant's support.",
          "dialogue_response": "\"I’ve got a grudge against them too. Let’s bring their lies into the light, together.\"",
          "choice_type": "dialogue",
          "player_perspective": "You meet their eyes with raw conviction, feeling a bond forged in shared injustice. The informant’s posture relaxes, a spark of hope flickering through their wary gaze.",
          "emotional_tone": "passionate and unifying",
          "body_language": "Straight posture, steady gaze, voice firm yet warm.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [
            {
              "id": "informant_alliance",
              "type": "status",
              "description": "Informant commits to supporting Sierra, strengthening resistance.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_shares_secret_plans_008",
          "internal_hint": "Calls on shared hostility to build alliance and advance plot.",
          "internal_justification": "Creates a character relationship tied to player’s emotional motivation enhancing depth and stakes."
        },
        {
          "id": "choice_gesture_open_hands",
          "text": "Use open and inviting gestures to encourage the informant’s trust.",
          "dialogue_response": null,
          "choice_type": "non-verbal",
          "player_perspective": "You slowly uncross your arms and extend your hands palms-up, nodding encouragingly. The informant's shoulders ease slightly, their eyes meeting yours with less suspicion.",
          "emotional_tone": "calming and sincere",
          "body_language": "Open palms, relaxed shoulders, slight forward lean.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "intel_vextros_connection_005",
          "internal_hint": "Non-verbal communication to build rapport.",
          "internal_justification": "Softens tension, leading informant to be more revealing over time."
        },
        {
          "id": "choice_interrupt_emotion",
          "text": "Interrupt when the informant becomes too fearful to speak clearly and steer the conversation back.",
          "dialogue_response": "\"Wait, slow down. Focus on one thing at a time—what’s the most critical piece we need to expose?\"",
          "choice_type": "dialogue",
          "player_perspective": "The informant hesitates, eyes darting nervously, about to retreat into fear, but your calm command grounds the moment. They take a breath and refocus, clearly eager to share one crucial fact.",
          "emotional_tone": "firm and grounding",
          "body_language": "Hands raised slightly to signal pause, steady eye contact.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "informant_shares_key_fact_009",
          "internal_hint": "Keep informant focused despite emotional distress.",
          "internal_justification": "Allows the narrative to deliver critical clues smoothly."
        },
        {
          "id": "choice_investigate_subtle_signs",
          "text": "Look for subtle signs of implant sickness or stress in the informant as they talk.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You carefully observe the informant’s blinking rate and pallor under the cave’s artificial lighting, noting faint tremors in their hands. You suspect implant sickness might be affecting their reliability or willingness to speak.",
          "emotional_tone": "alert and investigative",
          "body_language": "Focused gaze on the informant’s hands and face, slight tilt of head.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [
            {
              "id": "info_implant_weakness_observed",
              "type": "status",
              "description": "Noted signs of implant sickness in the informant, could leverage or aid them.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "intel_vextros_connection_005",
          "internal_hint": "Allows player to gain additional insight into informant's condition.",
          "internal_justification": "Adds depth to social dynamics and potential leverage."
        },
        {
          "id": "choice_reassure_without_words",
          "text": "Offer a reassuring smile and brief nod to keep trust intact without speaking.",
          "dialogue_response": null,
          "choice_type": "non-verbal",
          "player_perspective": "You flash a brief, sincere smile and a slow nod, trying to communicate solidarity and understanding without interrupting the informant’s fragile confession.",
          "emotional_tone": "supportive and subtle",
          "body_language": "Soft smile, gentle nod, relaxed posture.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "intel_vextros_connection_005",
          "internal_hint": "Micro-interaction strengthening rapport.",
          "internal_justification": "Non-verbal support encourages more openness."
        },
        {
          "id": "choice_skeptical_firm_interjection",
          "text": "Cut in with a skeptical but firm tone to challenge possible exaggeration.",
          "dialogue_response": "\"This sounds serious, but how can we be sure it's not fear twisting the facts? We need details, not rumors.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice interrupts sharply, slicing through the fear thickening the air. The informant steels themselves, surprised but silently respecting your demand for concrete evidence.",
          "emotional_tone": "direct and questioning",
          "body_language": "Eyes narrowed, forward lean, pointed gesture.",
          "requirements": {
            "grudge": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 2
          },
          "next_situation_id": "informant_gives_evidence_010",
          "internal_hint": "Applies pressure to move from fear to facts.",
          "internal_justification": "Forces narrative clarity and advancement of information."
        }
      ],
      "stat_requirements": {
        "grudge": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "info_vextros_motives": "Advances knowledge of faction corruption.",
        "informant_alliance": "Gains NPC support."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Advances knowledge of faction corruption.",
        "Gains NPC support."
      ]
    },
    "informant_deepens_trust_003": {
      "id": "informant_deepens_trust_003",
      "title": "The informant’s shoulders relax slightly. \"Okay, you seem like the real deal,\" they whisper. \"I can tell you about how the test controls the candidates’ implants during the trial—turning our own cybernetics against us. It’s all to break the weak-willed. And Vextros provides the control tech... a cold business in human suffering.\"",
      "description": "The informant’s shoulders relax slightly. \"Okay, you seem like the real deal,\" they whisper. \"I can tell you about how the test controls the candidates’ implants during the trial—turning our own cybernetics against us. It’s all to break the weak-willed. And Vextros provides the control tech... a cold business in human suffering.\"",
      "choices": [
        {
          "id": "choice_express_outrage",
          "text": "Voice your disgust clearly, showing resolve to fight the system.",
          "dialogue_response": "\"That’s monstrous. They’re weaponizing our own bodies? We have to stop this.\"",
          "choice_type": "dialogue",
          "player_perspective": "You clench your fists tightly, jaw set as your outrage simmers beneath your measured voice. The informant gives a quick, approving nod.",
          "emotional_tone": "furious and resolute",
          "body_language": "Fists clenched, squared stance, eyes blazing.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [
            {
              "id": "resolve_fight_control",
              "type": "status",
              "description": "Resolved to actively oppose implant control mechanisms through direct action.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "might": 1
          },
          "next_situation_id": "informant_suggests_counterplan_009",
          "internal_hint": "Player embraces active opposition to corrupted tech during selection.",
          "internal_justification": "Elevates player agency and frames future conflict."
        },
        {
          "id": "choice_question_implant_mechanics",
          "text": "Seek technical details on how implants are manipulated during selection.",
          "dialogue_response": "\"Explain how the implants are controlled and what they do to the test-takers.\"",
          "choice_type": "dialogue",
          "player_perspective": "You lean in, craving details not just for justice's sake, but tactical advantage. The informant hesitates, then explains invasive firmware overrides, forced shutdowns, and sensory overload protocols.",
          "emotional_tone": "curious and focused",
          "body_language": "Tilted head, furrowed brow, steady gaze.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [
            {
              "id": "info_implant_manipulation",
              "type": "status",
              "description": "Understood the technical methods Vextros and Phobos use to control implants in trials.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1
          },
          "next_situation_id": "informant_warns_implant_risks_010",
          "internal_hint": "Advances technical understanding of selection test manipulation.",
          "internal_justification": "Provides another information branch allowing expertise growth and future strategy."
        },
        {
          "id": "choice_reassure_informant_backup",
          "text": "Assure the informant you can protect them if things go sideways.",
          "dialogue_response": "\"Don’t worry. I won’t let them silence you. We’re in this together.\"",
          "choice_type": "dialogue",
          "player_perspective": "You reach a steadying hand toward their shoulder. Their body jitters but slowly relaxes as they whisper back, \"I wasn’t sure anyone was truly on our side down here.\"",
          "emotional_tone": "comforting and confident",
          "body_language": "Open stance, hand resting lightly on arm, warm eyes.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_shares_secret_network_011",
          "internal_hint": "Strengthens alliance feelings and potential support from informant.",
          "internal_justification": "Builds emotional solidarity enhancing player-NPC dynamics."
        },
        {
          "id": "choice_interrupt_express_impatience",
          "text": "Interrupt sharply, pushing for urgent action over talk.",
          "dialogue_response": "\"Enough talk—we don’t have time! What’s the plan?\"",
          "choice_type": "dialogue",
          "player_perspective": "You cut in abruptly, voice tightening with impatience. The informant blinks but nods, sensing your urgency.",
          "emotional_tone": "impatient and demanding",
          "body_language": "Leaning forward abruptly, eyes narrowed, tone clipped.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "might": 1,
            "savvy": -1
          },
          "next_situation_id": "informant_shares_hasty_plan_012",
          "internal_hint": "Player presses for speed, risking missing details.",
          "internal_justification": "Adds tension through impatience and forces potential rushed decisions."
        },
        {
          "id": "choice_nonverbal_assent_solemn",
          "text": "Nod solemnly, eyes meeting informant with steady resolve.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "You give a slow, solemn nod, meeting the informant’s gaze steadily to show quiet solidarity. They relax visibly.",
          "emotional_tone": "quietly supportive",
          "body_language": "Slow nod, calm expression, relaxed posture.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [
            {
              "id": "quiet_solidarity",
              "type": "status",
              "description": "Established a subtle but strong bond of trust.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_feels_encouraged_013",
          "internal_hint": "Nonverbal support deepening relationship trust.",
          "internal_justification": "Provides low-key but meaningful social interaction choice."
        },
        {
          "id": "choice_observe_fidgeting_hands",
          "text": "Notice and comment on the informant's nervous gestures.",
          "dialogue_response": "\"Your hands are shaking—are you alright?\"",
          "choice_type": "investigation",
          "player_perspective": "You catch the telltale tremble in their hands and ask gently, signaling you see more than just their words.",
          "emotional_tone": "concerned and attentive",
          "body_language": "Eyes tracking small movements, relaxed but focused.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_reveals_stress_cause_014",
          "internal_hint": "Player notices subtle stress cues prompting deeper understanding.",
          "internal_justification": "Encourages investigative attention to NPC micro-expressions."
        },
        {
          "id": "choice_inquire_about_common_knowledge",
          "text": "Ask if others know about the implant manipulation.",
          "dialogue_response": "\"Do many people here realize what they're doing with the implants?\"",
          "choice_type": "dialogue",
          "player_perspective": "You tilt your head slightly, voice thoughtful as you probe the informant’s knowledge about community awareness.",
          "emotional_tone": "curious and cautious",
          "body_language": "Slight lean in, shoulders relaxed, calm tone.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_explains_public_awareness_015",
          "internal_hint": "Gathers context about general population’s awareness and resistance potential.",
          "internal_justification": "Broadens narrative scope and prepares for social strategy."
        },
        {
          "id": "choice_offer_to_help_with_resources",
          "text": "Offer material support to aid informant's risk.",
          "dialogue_response": "\"I can get you supplies or secure a safe place if you need it.\"",
          "choice_type": "dialogue",
          "player_perspective": "You reach out with an earnest offer, showing your willingness to support beyond words.",
          "emotional_tone": "generous and protective",
          "body_language": "Open hands, slight forward lean, steady gaze.",
          "requirements": {
            "trust_informant": 1
          },
          "attributes_gained": [
            {
              "id": "supportive_ally",
              "type": "status",
              "description": "Strengthened alliance with promise of tangible help.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "opulence": 1,
            "integrity": 1
          },
          "next_situation_id": "informant_feels_secured_016",
          "internal_hint": "Deepens alliance through offers of practical aid.",
          "internal_justification": "Builds trust and access to future resources."
        }
      ],
      "stat_requirements": {
        "trust_informant": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "info_implant_manipulation": "Technical intel unlocks options.",
        "integrity": "Relationship trust deepens.",
        "resolve_fight_control": "Player motivated for direct opposition.",
        "quiet_solidarity": "Established low-key but strong trust.",
        "supportive_ally": "Potential future aid from informant.",
        "insight": "Enhanced understanding of informant state and public awareness."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Technical intel unlocks options.",
        "Relationship trust deepens.",
        "Player motivated for direct opposition.",
        "Established low-key but strong trust.",
        "Potential future aid from informant.",
        "Enhanced understanding of informant state and public awareness."
      ]
    },
    "informant_responds_hostility_004": {
      "id": "informant_responds_hostility_004",
      "title": "The informant nods stiffly, voice lowered. \"Outside, they keep eyes peeled for any sign of outsiders poking their noses. Here in the Akropolis, they treat us like we’re expendable. Vextros puppet or not, surviving is about looking tougher than you are.\" They narrow their eyes at you. \"Don’t stick out.\"",
      "description": "The informant nods stiffly, voice lowered. \"Outside, they keep eyes peeled for any sign of outsiders poking their noses. Here in the Akropolis, they treat us like we’re expendable. Vextros puppet or not, surviving is about looking tougher than you are.\" They narrow their eyes at you. \"Don’t stick out.\"",
      "choices": [
        {
          "id": "choice_silence_respectful",
          "text": "Stay silent, acknowledging the harsh reality without pressing further.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You nod slightly, giving a small tight smile that says everything needn't be said. Sometimes silence is the most potent signal.",
          "emotional_tone": "understanding and cautious",
          "body_language": "Nods slowly, neutral face, controlled breathing.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Use silence to build nonverbal rapport avoiding retaliation.",
          "internal_justification": "Grants player option to maintain low profile during tense moment."
        },
        {
          "id": "choice_challenge_anti_outsider_sentiment",
          "text": "Question the logic of dismissing outsiders as weaker.",
          "dialogue_response": "\"Saying outsiders are weaker just feeds their divide and conquer. How do you survive thinking like that?\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice carries a challenge laced with genuine concern. The informant’s eyes flash briefly with frustration, then retreating. \"It’s not about who’s weak, it’s about who’s prepared to do what’s necessary.\"",
          "emotional_tone": "critical and probing",
          "body_language": "Eyebrows raised, finger tapping chin, stepping slightly forward.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_asks_about_outsider_perspective_013",
          "internal_hint": "Explores social dynamics and challenges prejudicial mindset.",
          "internal_justification": "Deepens social conflict and potential character growth."
        },
        {
          "id": "choice_offer_personal_perspective",
          "text": "Share your own experience as an outsider to build empathy.",
          "dialogue_response": "\"I’ve been judged the same way. It’s a raw wound to carry. But I’m still standing.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice softens, eyes flickering with past pain. The informant’s face tightens, then softens slowly, relating to your hardship.",
          "emotional_tone": "vulnerable and connective",
          "body_language": "Relaxed posture, hands loosely at side, steady gaze.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_shares_hidden_facts_014",
          "internal_hint": "Utilizes shared vulnerability to advance trust.",
          "internal_justification": "Fosters NPC empathy and bonds with player."
        },
        {
          "id": "choice_interrupt_with_irony",
          "text": "Interrupt with a bitter chuckle, \"So the key to survival is to look mean? Sounds like a child’s playground rule.\"",
          "dialogue_response": "\"So the key to survival is to look mean? Sounds like a child's playground rule.\"",
          "choice_type": "dialogue",
          "player_perspective": "You let a dry chuckle slip through before the informant can finish. Their eyes harden; a tense silence follows, signaling a line nearly crossed.",
          "emotional_tone": "sarcastic and sardonic",
          "body_language": "Leaning forward with a crooked smile, eyes scanning their reaction.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "insight": 1
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Use irony to challenge status quo and gauge NPC limits.",
          "internal_justification": "Adds a confrontational but playful flavor to interaction, tests NPC patience."
        },
        {
          "id": "choice_observe_body_language",
          "text": "Quietly note informant’s subtle tremor in hands and fidgeting eyes.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You shift gaze discreetly to their hands and fleeting eye movements, catching a tension betraying their tough exterior.",
          "emotional_tone": "observant and calm",
          "body_language": "Steady gaze, slight tilt of head, absorbing non-verbal cues.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "observant",
              "type": "status",
              "description": "Noted the informant's concealed anxiety despite harsh words.",
              "stat_mods": {
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Allows subtle social cues to deepen understanding.",
          "internal_justification": "Allows player to build social insight without verbal confrontation."
        },
        {
          "id": "choice_soften_tone_with_question",
          "text": "Ask gently, \"What do you think outsiders could do to gain your trust?\"",
          "dialogue_response": "\"What do you think outsiders could do to gain your trust?\"",
          "choice_type": "dialogue",
          "player_perspective": "Your tone lowers, eyes searching theirs for a flicker of hope beneath defensiveness.",
          "emotional_tone": "gentle and inquisitive",
          "body_language": "Open hands resting on knees, slight forward lean.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "insight": 1
          },
          "next_situation_id": "informant_cautious_opportunity_015",
          "internal_hint": "Invites NPC to reveal vulnerabilities or guarded perspectives.",
          "internal_justification": "Creates opening for deeper empathy and possible alliance."
        },
        {
          "id": "choice_steer_conversation_to_common_ground",
          "text": "Shift conversation, \"Regardless of where we’re from, survival means everyone must have each other's backs sometimes, right?\"",
          "dialogue_response": "\"Regardless of where we’re from, survival means everyone must have each other's backs sometimes, right?\"",
          "choice_type": "dialogue",
          "player_perspective": "You meet their narrowed eyes steadily, trying to anchor the talk on shared necessity.",
          "emotional_tone": "diplomatic and hopeful",
          "body_language": "Firm gaze, no aggression, slight nod inviting agreement.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "insight": 1
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Reduces tension by emphasizing common interests.",
          "internal_justification": "Enables cooperation despite differences, builds tentative trust."
        },
        {
          "id": "choice_subtle_reach_out_hand",
          "text": "Extend a subtle hand gesture: a small, tentative invitation for mutual respect.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "Your hand twitches slightly, pausing mid-air—an unspoken offer of truce. Their eyes flicker down then back up, weighing the gesture.",
          "emotional_tone": "peaceful and conciliatory",
          "body_language": "Slow, deliberate hand movement, no sudden motions.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "tentative_truce",
              "type": "status",
              "description": "Made a silent offer of respect to the informant.",
              "stat_mods": {
                "integrity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Nonverbal bridge building through peaceful gesture.",
          "internal_justification": "Expands player options beyond verbal dialogue, fostering relationship building."
        },
        {
          "id": "choice_internal_reaction_clench_jaw",
          "text": "Internally clench your jaw, steeling resolve to not let bitterness show.",
          "dialogue_response": null,
          "choice_type": "internal_reaction",
          "player_perspective": "You feel the familiar tightening in your jaw, a shield against bitterness and despair. Your breathing steadies as resolve hardens beneath the surface.",
          "emotional_tone": "controlled and determined",
          "body_language": null,
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "informant_briefs_nextsteps_012",
          "internal_hint": "Internal emotional management building resilience.",
          "internal_justification": "Represents player mental fortitude growth quietly."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {
        "integrity": "Deepened connection and trust.",
        "insight": "Increased social awareness."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Deepened connection and trust.",
        "Increased social awareness."
      ]
    },
    "atrium_uprising_root": {
      "id": "atrium_uprising_root",
      "title": "In the heart of Crescent Center's Level 20 Atrium, the artificial garden buzzes with unrest. A crowd of Open Blocks agitators gather, their chants mixing with the hum of distant surveillance drones. Vextros enforcers stand rigidly near the balconies, eyes scanning for threats. Sierra Violet finds herself caught between these opposing forces, her grudge against Vextros fueling a fire within. Suddenly, a young woman from The Open Blocks, visibly tense but determined, approaches you urgently, whispering about plans to disrupt the oppressive stratum and questioning if you'll stand with them or stay silent. The scene vibrates with a charged atmosphere as both factions prepare to clash over control of this symbolic space.",
      "description": "In the heart of Crescent Center's Level 20 Atrium, the artificial garden buzzes with unrest. A crowd of Open Blocks agitators gather, their chants mixing with the hum of distant surveillance drones. Vextros enforcers stand rigidly near the balconies, eyes scanning for threats. Sierra Violet finds herself caught between these opposing forces, her grudge against Vextros fueling a fire within. Suddenly, a young woman from The Open Blocks, visibly tense but determined, approaches you urgently, whispering about plans to disrupt the oppressive stratum and questioning if you'll stand with them or stay silent. The scene vibrates with a charged atmosphere as both factions prepare to clash over control of this symbolic space.",
      "choices": [
        {
          "id": "accept_open_blocks_aid",
          "text": "I stand with you. Let's make them remember who owns this place.",
          "dialogue_response": "Count me in. They’ve pushed too far for too long.",
          "choice_type": "dialogue",
          "player_perspective": "Your resolve sends a flicker of hope across her face. A few others nearby nod in approval, their whispers growing louder with newfound determination. You feel the first step of rebellion pulse beneath your skin.",
          "emotional_tone": "determined",
          "body_language": "You square your shoulders, meet her gaze steadily, and clamp your jaw tight.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "ally_open_blocks",
              "type": "status",
              "description": "Allied with The Open Blocks uprising in Crescent Center.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_planning",
          "internal_hint": "Player commits to supporting The Open Blocks in the uprising.",
          "internal_justification": "This choice engages the player directly with the uprising, establishing alliance and giving narrative momentum."
        },
        {
          "id": "refuse_open_blocks_aid",
          "text": "I can’t risk drawing more attention right now. I’m out.",
          "dialogue_response": "Not my fight—right now, I need to stay under the radar.",
          "choice_type": "dialogue",
          "player_perspective": "The woman’s eyes flicker with disappointment but she nods, understanding the danger. You sense the restless crowd’s tension rising without your involvement; the distance between you and the conflict seems to grow heavier.",
          "emotional_tone": "cautious",
          "body_language": "You avoid eye contact, slightly turning away as your jaw tightens in silent warning.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_observer",
          "internal_hint": "Player chooses to stay uninvolved for now, observing the uprising from aside.",
          "internal_justification": "Offers a non-combat role and allows player to gather more info without immediate commitment."
        },
        {
          "id": "challenge_vextros_enforcer",
          "text": "Say to the enforcer: 'Your grip on this city tightens, but it will break.'",
          "dialogue_response": "Your grip on this city tightens, but it will break. People see through your lies.",
          "choice_type": "dialogue",
          "player_perspective": "The enforcer’s eyes narrow sharply. A low murmur ripples through the crowd as tension spikes palpably. The standoff feels electric—will words sway or spark violence?",
          "emotional_tone": "confrontational",
          "body_language": "You lean forward with a defiant glare, voice low but clear.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "noticed_by_vextros",
              "type": "status",
              "description": "Marked as a threat by Vextros enforcers.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "allure": -1
          },
          "next_situation_id": "atrium_uprising_standoff",
          "internal_hint": "Player openly challenges Vextros, attracting hostile attention.",
          "internal_justification": "Heightens conflict and raises stakes through direct provocation, showcasing player's grudge in action."
        },
        {
          "id": "quietly_gather_info",
          "text": "Eavesdrop on conversations around the Atrium to learn more about The Open Blocks’ plans.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You blend into the edges of the crowd, tuning your implants to catch whispered exchanges. Nearby, two Open Blocks members debate strategy, their words fraying with urgency: \"If we don’t control the garden tonight, we lose the symbolic heart of Crescent Center.\" The mention of Vextros’ vulnerabilities sharpens your focus.",
          "emotional_tone": "curious",
          "body_language": "You shift subtly, eyes flicking between faces, nodding occasionally as you absorb snippets.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_info_gathered",
          "internal_hint": "Player gathers tactical intelligence, shaping future options.",
          "internal_justification": "Encourages player to engage deeply with environment and faction dynamics, allowing informed decisions."
        },
        {
          "id": "show_frustration_with_open_blocks",
          "text": "Express skepticism: 'Is this just another fight destined to crush the people it claims to save?'",
          "dialogue_response": "Is this just another fight destined to crush the people it claims to save? I don’t see the difference.",
          "choice_type": "dialogue",
          "player_perspective": "Her brows furrow, hurt flickering in her eyes but hardening quickly. Around you, murmurs pulse with both agreement and discomfort. The complexity of rebellion weighs on everyone present.",
          "emotional_tone": "cynical",
          "body_language": "You cross your arms tightly, voice rough, gaze distant yet piercing.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "cynical_about_rebellion",
              "type": "status",
              "description": "Harbors doubts about the effectiveness of The Open Blocks’ uprising.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "savvy": -1
          },
          "next_situation_id": "atrium_uprising_doubt",
          "internal_hint": "Player voices doubts on uprising’s impact, increasing narrative nuance.",
          "internal_justification": "Adds depth to player perspective and fosters potential for internal conflict within the arc."
        },
        {
          "id": "interrupt_and_redirect",
          "text": "Interrupt firmly: 'Hold on, what’s the plan exactly? We can't just rush in and get crushed.'",
          "dialogue_response": "Hold on, what’s the plan exactly? We can't just rush in and get crushed.",
          "choice_type": "dialogue",
          "player_perspective": "Your voice cuts through the chatter, drawing eyes to you. The woman nods, grateful for the pragmatism as she begins outlining details, the tension easing slightly among the nearby rebels.",
          "emotional_tone": "assertive",
          "body_language": "You raise a hand slightly, signaling for calm, your tone measured but firm.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_planning",
          "internal_hint": "Player steers the conversation toward practical strategy.",
          "internal_justification": "Demonstrates leadership and cautious optimism, building trust with Open Blocks."
        },
        {
          "id": "nonverbal_affirmation",
          "text": "Nod firmly without speaking, showing your commitment with a steady gaze.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "Your steady nod and unwavering eye contact speak volumes. The young woman’s face brightens, and others nearby exchange approving glances, sensing your silent but fierce agreement.",
          "emotional_tone": "resolute",
          "body_language": "You meet her eyes steadily, nodding once with determination, lips pressed into a thin line.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "ally_open_blocks",
              "type": "status",
              "description": "Allied with The Open Blocks uprising in Crescent Center.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_planning",
          "internal_hint": "Player nonverbally affirms alliance and builds rapport.",
          "internal_justification": "Provides an option for players who prefer subtle roleplay and nonverbal communication."
        },
        {
          "id": "show_empathy_for_rebels",
          "text": "Softly say: 'I know why you're fighting. I’ve seen what they do. You’re not alone.'",
          "dialogue_response": "I know why you're fighting. I’ve seen what they do. You’re not alone.",
          "choice_type": "dialogue",
          "player_perspective": "Your words draw a flicker of relief from her taut features. Those nearby lean in, the warmth spreading subtly and easing the harshness of the moment.",
          "emotional_tone": "compassionate",
          "body_language": "You relax your stance slightly, voice low but steady and compassionate.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "allure": 1
          },
          "next_situation_id": "atrium_uprising_planning",
          "internal_hint": "Player expresses understanding, strengthening bond with rebels.",
          "internal_justification": "Fosters deeper emotional connection and potential alliances through empathy."
        },
        {
          "id": "observe_vextros_reaction",
          "text": "Discreetly watch the Vextros enforcers to detect any signs of nervousness or weakness.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You subtly shift your gaze to the corporate enforcers, noting slight twitches and averted glances betraying their rigid façade. One’s hand lingers near a holstered weapon—a flicker of doubt perhaps?",
          "emotional_tone": "cautious",
          "body_language": "You lean slightly behind a nearby pillar, narrowing your eyes as you scan the enforcers' stance and microexpressions.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_info_gathered",
          "internal_hint": "Player collects intelligence on Vextros forces.",
          "internal_justification": "Expands investigative options, enriching player’s tactical awareness."
        },
        {
          "id": "challenge_rebel_leadership",
          "text": "Question the plan’s leadership: 'Who’s really calling the shots? I need to know who to trust.'",
          "dialogue_response": "Who’s really calling the shots? I need to know who to trust.",
          "choice_type": "dialogue",
          "player_perspective": "Your pointed question draws a momentary hush. The woman’s jaw tightens, then she answers with resolve, naming a council of leaders, her tone edged but honest. Others nod, their trust cautiously extended.",
          "emotional_tone": "skeptical",
          "body_language": "You lean in, eyes slightly narrowed, voice calm but compelling.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_planning",
          "internal_hint": "Player probes into rebel leadership and trustworthiness.",
          "internal_justification": "Develops internal faction dynamics and trust issues, adding complexity."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {
        "noticed_by_vextros": "Player is marked and surveilled by Vextros security, increasing danger.",
        "cynical_about_rebellion": "Player expresses doubts, creating social friction with more idealistic rebels.",
        "ally_open_blocks": "Player gains allies and active role in uprising; faces greater risks from Vextros.",
        "stat_changes": "Adjust player stats reflecting tension, insight, tenacity, and social standing."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Player is marked and surveilled by Vextros security, increasing danger.",
        "Player expresses doubts, creating social friction with more idealistic rebels.",
        "Player gains allies and active role in uprising; faces greater risks from Vextros.",
        "Adjust player stats reflecting tension, insight, tenacity, and social standing."
      ]
    },
    "atrium_uprising_acceptance_dialogue": {
      "id": "atrium_uprising_acceptance_dialogue",
      "title": "The Open Blocks woman leans in closer, her eyes searching yours for a spark of solidarity. Around you, the crowd’s murmurs swell into a chant as the tension thickens. She whispers hurried plans about taking control of the Atrium’s garden tonight and asks: \"Are you ready to be more than a ghost in the shadows?\"",
      "description": "The Open Blocks woman leans in closer, her eyes searching yours for a spark of solidarity. Around you, the crowd’s murmurs swell into a chant as the tension thickens. She whispers hurried plans about taking control of the Atrium’s garden tonight and asks: \"Are you ready to be more than a ghost in the shadows?\"",
      "choices": [
        {
          "id": "accept_enthusiastically",
          "text": "Count me in. They’ve pushed too far for too long.",
          "dialogue_response": "Count me in. They’ve pushed too far for too long.",
          "choice_type": "dialogue",
          "player_perspective": "Her face lights with a triumphant smile. Nearby rebels nod approvingly. The air crackles with newfound momentum; your choice is a spark igniting the crowd.",
          "emotional_tone": "determined",
          "body_language": "You square your shoulders, meet her gaze steadily, and clamp your jaw tight.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "ally_open_blocks",
              "type": "status",
              "description": "Allied with The Open Blocks uprising in Crescent Center.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_planning_meeting",
          "internal_hint": "Player fully commits to joining the uprising and gains trust of Open Blocks.",
          "internal_justification": "Creates a committed faction alliance, advancing plot and opening new narrative options."
        },
        {
          "id": "hesitate_but_concerned",
          "text": "I want to help, but is this plan really going to change anything?",
          "dialogue_response": "I want to help, but is this plan really going to change anything?",
          "choice_type": "dialogue",
          "player_perspective": "Her eyes sharpen briefly—challenge met with cautious respect. The crowd’s chant dims into an anxious hum, awaiting reassurance.",
          "emotional_tone": "cautious",
          "body_language": "You shift weight between feet, eyes flicking between her and the restless crowd.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_planning_meeting",
          "internal_hint": "Player expresses doubt but remains involved, opening nuanced dialogue.",
          "internal_justification": "Adds narrative depth by showing inner conflict without rejection."
        },
        {
          "id": "decline_firmly",
          "text": "I can’t risk this. Too many eyes on me already.",
          "dialogue_response": "I can’t risk this. Too many eyes on me already.",
          "choice_type": "dialogue",
          "player_perspective": "Her lips tighten, a flicker of disappointment in her eyes. Around you, some rebels exchange wary glances. The tension shifts, sensing your withdrawal.",
          "emotional_tone": "cautious",
          "body_language": "You avoid eye contact, cross your arms defensively, voice low but resolute.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_observer",
          "internal_hint": "Player refuses to join but stays observant.",
          "internal_justification": "Allows player to gather info while not committing, preserving options."
        },
        {
          "id": "smile_reassuringly",
          "text": "Your voice trembles, but your smile is steady. \"I won’t be easily forgotten.\"",
          "dialogue_response": "I won’t be easily forgotten.",
          "choice_type": "dialogue",
          "player_perspective": "Her surprise flickers into approval. The crowd nearby relaxes slightly, buoyed by your quiet confidence.",
          "emotional_tone": "hopeful",
          "body_language": "You smile softly, eyes locking on hers as a silent vow.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "open_blocks_trust",
              "type": "status",
              "description": "Earned some trust from The Open Blocks by showing hope and commitment.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "allure": 1
          },
          "next_situation_id": "atrium_uprising_planning_meeting",
          "internal_hint": "Player expresses gentle but firm commitment, building rapport.",
          "internal_justification": "Introduces nuanced ally-building without outright joining."
        },
        {
          "id": "notice_stranger_in_crowd",
          "text": "You subtly glance at a tense stranger near the edge of the crowd, picking up a coded tattoo.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your eyes catch a flicker of movement and the glimpse of an unmistakable Vextros insignia tattoo partially hidden on a sleeve. Alarm bells ring silently as you consider the implications.",
          "emotional_tone": "alert",
          "body_language": "You shift inconspicuously, letting your gaze linger just long enough to take note.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_security_warning",
          "internal_hint": "Player notices potential infiltrator, enabling security preparations.",
          "internal_justification": "Adds tension and role for player as vigilant observer."
        },
        {
          "id": "emotional_reveal_whisper",
          "text": "Your voice drops almost to a whisper, tension creeping into your tone: \"If this fails, it’ll all be worse. But I can’t stand not trying.\"",
          "dialogue_response": "If this fails, it’ll all be worse. But I can’t stand not trying.",
          "choice_type": "dialogue",
          "player_perspective": "She nods solemnly, the weight of shared desperation binding you closer. Whispered murmurs ripple through the crowd, sealing a fragile solidarity.",
          "emotional_tone": "resigned but hopeful",
          "body_language": "You lean in, voice low but steady, eyes meeting hers with raw honesty.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "trusted_by_open_blocks",
              "type": "status",
              "description": "Trusted by Open Blocks for honest vulnerability.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_planning_meeting",
          "internal_hint": "Player reveals emotional and philosophical alignment, deepening trust.",
          "internal_justification": "Allows narrative depth and roleplay opportunity in emotional vulnerability."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {
        "stat_changes": "Reflects player commitment and insight levels.",
        "ally_open_blocks": "Player gains allies and active role in uprising; faces greater risks from Vextros."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Reflects player commitment and insight levels.",
        "Player gains allies and active role in uprising; faces greater risks from Vextros."
      ]
    },
    "atrium_uprising_vextros_standoff": {
      "id": "atrium_uprising_vextros_standoff",
      "title": "A tall Vextros enforcer steps forward from the balcony, eyes cold and unblinking as he addresses you with a smirk: \"You’re stirring trouble where none is needed. Step back or face consequences.\" His hand subtly brushes a concealed weapon. The crowd’s roar quiets, tension coiling like a spring.",
      "description": "A tall Vextros enforcer steps forward from the balcony, eyes cold and unblinking as he addresses you with a smirk: \"You’re stirring trouble where none is needed. Step back or face consequences.\" His hand subtly brushes a concealed weapon. The crowd’s roar quiets, tension coiling like a spring.",
      "choices": [
        {
          "id": "respond_confrontational",
          "text": "Your grip on this city tightens, but it will break. People see through your lies.",
          "dialogue_response": "Your grip on this city tightens, but it will break. People see through your lies.",
          "choice_type": "dialogue",
          "player_perspective": "His eyes flash with irritation, lips curling into a hostile grin. The crowd murmurs rise—risk balanced on a razor edge.",
          "emotional_tone": "confrontational",
          "body_language": "You lean forward with a defiant glare, voice low but clear.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "noticed_by_vextros",
              "type": "status",
              "description": "Marked as a threat by Vextros enforcers.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "allure": -1
          },
          "next_situation_id": "atrium_uprising_standoff_tense",
          "internal_hint": "Provokes Vextros enforcer into confrontation.",
          "internal_justification": "Escalates tension and sets up immediate conflict."
        },
        {
          "id": "respond_diplomatic",
          "text": "There’s no need for violence—let’s find common ground.",
          "dialogue_response": "There’s no need for violence—let’s find common ground.",
          "choice_type": "dialogue",
          "player_perspective": "The enforcer narrows his eyes, evaluating your tone. The crowd quiets cautiously, unsure if this is weakness or strategy.",
          "emotional_tone": "diplomatic",
          "body_language": "You raise your hands slightly, voice calm but steady.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "tenacity": -1
          },
          "next_situation_id": "atrium_uprising_standoff_dialogue",
          "internal_hint": "Player tries de-escalation with Vextros enforcer.",
          "internal_justification": "Opens chance for negotiation or gathering info without immediate violence."
        },
        {
          "id": "ignore_and_move",
          "text": "You dismiss him with a wave and turn back to the crowd.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "The enforcer’s jaw tightens, and he steps closer, fingers twitching near his weapon, but you’ve shifted focus. The tension simmers but doesn’t snap—yet.",
          "emotional_tone": "defiant",
          "body_language": "You flick your hand dismissively, shoulders squared away from the threat.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_standoff_ignored",
          "internal_hint": "Player refuses to engage directly with Vextros enforcer.",
          "internal_justification": "Subtle choice that risks ire but preserves player agency."
        },
        {
          "id": "probe_for_info",
          "text": "You ask quietly, “What’s really behind this crackdown? I’m sure the people deserve to know.”",
          "dialogue_response": "What’s really behind this crackdown? I’m sure the people deserve to know.",
          "choice_type": "dialogue",
          "player_perspective": "The enforcer blinks, momentarily caught off guard. His smirk twitches, and the crowd leans in, sensing a crack in his armor.",
          "emotional_tone": "inquisitive",
          "body_language": "You lean your head slightly, brows furrowed, voice lowered as if sharing a secret.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_standoff_info",
          "internal_hint": "Attempt to gather information under pressure.",
          "internal_justification": "Encourages player to engage intellectually and potentially reveal faction tacticts."
        },
        {
          "id": "smile_and_taunt",
          "text": "With a sly grin, you say, “Careful, your boss might not like how relaxed you are.”",
          "dialogue_response": "Careful, your boss might not like how relaxed you are.",
          "choice_type": "dialogue",
          "player_perspective": "A flicker of uncertainty crosses the enforcer’s face; the crowd chuckles, emboldened.",
          "emotional_tone": "mocking",
          "body_language": "You flash a confident smile, shoulders back, eyes glinting with mischief.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "noticed_by_vextros",
              "type": "status",
              "description": "Marked as a threat by Vextros enforcers.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "allure": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_standoff_mocked",
          "internal_hint": "Taunts the enforcer to provoke a reaction.",
          "internal_justification": "Raises tension and deepens player’s rebellious stance."
        },
        {
          "id": "silent_steady_stare",
          "text": "You hold his gaze steadily without a word, lips pressed tight.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "The enforcer’s eyes flicker as if searching for weakness, but your silence unnerves him more. The crowd shifts, the charged silence stretching.",
          "emotional_tone": "intimidating",
          "body_language": "Your face is unreadable, gaze locked unwaveringly on him.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "noticed_by_vextros",
              "type": "status",
              "description": "Marked as a threat by Vextros enforcers.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 2,
            "allure": -1
          },
          "next_situation_id": "atrium_uprising_standoff_stalemate",
          "internal_hint": "Non-verbal intimidation to unsettle the opponent.",
          "internal_justification": "Promotes tension through body language and psychological play."
        },
        {
          "id": "interrupt_and_redirect",
          "text": "You raise your hand briskly: “Enough of threats—what do the people want? Let them speak!”",
          "dialogue_response": "Enough of threats—what do the people want? Let them speak!",
          "choice_type": "dialogue",
          "player_perspective": "Your sudden interruption slices through the tension. Some rebels cheer quietly while the enforcer blinks, taken aback for a moment.",
          "emotional_tone": "assertive",
          "body_language": "You raise your hand sharply with determination, voice ringing clearly.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_standoff_shift_focus",
          "internal_hint": "Redirect conversation to empower rebels and put pressure on enforcer.",
          "internal_justification": "Steers dialogue to rally support and change dynamics."
        },
        {
          "id": "observe_environment",
          "text": "You subtly scan the balcony and crowd for signs of hidden weapons or allies.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your eyes flit across the shadows and faces, noting a faint glint near a railing and a hand twitching beneath a jacket—secrets lurking just beneath the surface.",
          "emotional_tone": "cautious",
          "body_language": "You glance discreetly around, adjusting your stance to stay alert.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_standoff_info_gathered",
          "internal_hint": "Gather tactical information during tense dialogue.",
          "internal_justification": "Encourages player's tactical awareness and information gathering in conflict."
        }
      ],
      "stat_requirements": {
        "noticed_by_vextros": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "noticed_by_vextros": "Player faces higher surveillance and danger from Vextros security.",
        "stat_changes": "Adjusts allure, tenacity, savviness, and insight depending on response."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Player faces higher surveillance and danger from Vextros security.",
        "Adjusts allure, tenacity, savviness, and insight depending on response."
      ]
    },
    "atrium_uprising_planning_meeting": {
      "id": "atrium_uprising_planning_meeting",
      "title": "Inside a dim side corridor overlooking the garden, the Open Blocks faction leaders gather around a holographic map flickering faintly. The woman who approached you gestures for you to join. \"We need your eyes and grit,\" she says, voice low but steady. Discussion buzzes about timing, possible infiltrations, and the rally points. You catch fragments of concern about Vextros reinforcements and suspicion of traitors.",
      "description": "Inside a dim side corridor overlooking the garden, the Open Blocks faction leaders gather around a holographic map flickering faintly. The woman who approached you gestures for you to join. \"We need your eyes and grit,\" she says, voice low but steady. Discussion buzzes about timing, possible infiltrations, and the rally points. You catch fragments of concern about Vextros reinforcements and suspicion of traitors.",
      "choices": [
        {
          "id": "offer_strategy_insight",
          "text": "We should time the disruption with the shift change. They’ll be weaker, distracted.",
          "dialogue_response": "We should time the disruption with the shift change. They’ll be weaker, distracted.",
          "choice_type": "dialogue",
          "player_perspective": "Heads nod thoughtfully. A grizzled leader claps your shoulder, eyes sharp with newfound respect.",
          "emotional_tone": "strategic",
          "body_language": "You lean in, finger tracing points on the map confidently.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player demonstrates tactical awareness, bolstering trust.",
          "internal_justification": "Encourages player leadership within uprising, rewarding savvy."
        },
        {
          "id": "express_concerns_about_spies",
          "text": "How do we know there aren’t Vextros moles in our group?",
          "dialogue_response": "How do we know there aren’t Vextros moles in our group?",
          "choice_type": "dialogue",
          "player_perspective": "Tension tightens. Eyes flicker between rebels, suspicion flashing. The woman who invited you bristles, voice sharp and defensive.",
          "emotional_tone": "cautious",
          "body_language": "You fold your arms, gaze scanning faces for signs of deceit.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": -1,
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player introduces distrust element among rebels.",
          "internal_justification": "Adds social tension and complexity to faction dynamics."
        },
        {
          "id": "stay_quiet_and_listen",
          "text": "You listen more than talk, absorbing the plans and undercurrents.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You nod slowly, your silence a statement amidst the volley of ideas. Whispers reach your implants, and your mind races with possibilities.",
          "emotional_tone": "thoughtful",
          "body_language": "You remain still, gaze steady but unreadable.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player takes observer role gaining insight.",
          "internal_justification": "Allows player to build knowledge and trust in faction plans."
        },
        {
          "id": "interrupt_with_urgent_question",
          "text": "Wait—what about securing the communication lines? If Vextros cuts our signals, we’re blind.",
          "dialogue_response": "Wait—what about securing the communication lines? If Vextros cuts our signals, we’re blind.",
          "choice_type": "dialogue",
          "player_perspective": "A few heads snap to attention, some nodding quickly while others exchange worried glances. You inject a new urgency into the discussion.",
          "emotional_tone": "urgent",
          "body_language": "You raise a hand sharply, voice cutting through the murmurs.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player clarifies an overlooked tactical vulnerability.",
          "internal_justification": "Introduces a new layer of strategic thinking, fostering leadership."
        },
        {
          "id": "smile_and_offer_reassurance",
          "text": "We’ve been through worse. They don’t know our streets like we do.",
          "dialogue_response": "We’ve been through worse. They don’t know our streets like we do.",
          "choice_type": "dialogue",
          "player_perspective": "A warmth spreads through some faces as tension eases, bolstered by your confidence. The woman who invited you offers a grateful nod.",
          "emotional_tone": "reassuring",
          "body_language": "You flash a quick, confident smile, shoulders relaxing.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "allure": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player strengthens morale and trust amongst rebels.",
          "internal_justification": "Builds emotional support networks and player reputation."
        },
        {
          "id": "silent_eye_contact_challenge",
          "text": "You hold steady eye contact with the accuser, refusing to back down.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "The room grows tense as your gaze locks with the most suspicious leader. Neither of you blinks first, the silent challenge thick in the air.",
          "emotional_tone": "defiant",
          "body_language": "You lean forward slightly, jaw clenched, unflinching.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 2,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player asserts presence and refuses intimidation silently.",
          "internal_justification": "Allows player to influence faction social dynamics through nonverbal strength."
        },
        {
          "id": "inspect_nearby_leader_implant",
          "text": "You lean slightly to observe the implant interface on a leader’s neck for signs of tampering.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your gaze discreetly fixes on the cybernetic implant of a particularly nervous leader. A faint irregularity catches your eye beneath the surface.",
          "emotional_tone": "curious",
          "body_language": "You shift subtly but intentionally, observing with a furrowed brow.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player investigates potential sabotage or infiltration.",
          "internal_justification": "Provides a chance to discover plot-relevant secrets, adding tension."
        },
        {
          "id": "quietly_note_evasive_body_language",
          "text": "You quietly note subtle signs of tension and evasion in the posture of some rebels.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "While others talk, your eyes catch slight twitches, crossed arms, and darting glances that hint at fractured trust beneath the surface.",
          "emotional_tone": "observant",
          "body_language": "You ground your breathing, focusing on micro-expressions without drawing attention.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player builds awareness of underlying social fractures.",
          "internal_justification": "Adds subtle social complexity and helps player grasp faction dynamics."
        }
      ],
      "stat_requirements": {
        "ally_open_blocks": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "stat_changes": "Savvy and insight shifted reflecting player input or observation."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Savvy and insight shifted reflecting player input or observation."
      ]
    },
    "atrium_uprising_observer": {
      "id": "atrium_uprising_observer",
      "title": "You hang back near a fractured pillar, watching the crowd and listening to snatches of fervent speech and quiet arguments. Nearby, an Open Blocks member eyes you with suspicion but says nothing. Vextros enforcers patrol with practiced vigilance, their presence a constant shadow. You sense the undercurrent of frustration and desperation crackling through the gathering.",
      "description": "You hang back near a fractured pillar, watching the crowd and listening to snatches of fervent speech and quiet arguments. Nearby, an Open Blocks member eyes you with suspicion but says nothing. Vextros enforcers patrol with practiced vigilance, their presence a constant shadow. You sense the undercurrent of frustration and desperation crackling through the gathering.",
      "choices": [
        {
          "id": "approach_and_request_info",
          "text": "Quietly approach the woman from Open Blocks to ask more about their plans.",
          "dialogue_response": "I’m interested. Tell me more about what you hope to accomplish tonight.",
          "choice_type": "dialogue",
          "player_perspective": "Her eyes narrow, then soften—a fragile trust forming. She leans in, voice barely above a whisper, words heavy with urgency.",
          "emotional_tone": "curious",
          "body_language": "You step forward slowly, hands visible and relaxed.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_info_shared",
          "internal_hint": "Player opts to build connection despite initial reluctance.",
          "internal_justification": "Supports narrative depth through relationship building and intelligence gathering."
        },
        {
          "id": "remain_hidden_and_listen",
          "text": "Keep to the shadows and eavesdrop without revealing yourself.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You fold into the crowd’s edges, senses sharpening on whispered words and subtle shifts. The tension seems to thicken, waiting to snap.",
          "emotional_tone": "stealthy",
          "body_language": "You stay low, expression neutral, eyes scanning.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_info_gathered",
          "internal_hint": "Player chooses intelligence gathering through stealth.",
          "internal_justification": "Maintains narrative flexibility and fosters information control."
        },
        {
          "id": "leave_area_for_now",
          "text": "Decide not to get involved and quietly exit the Atrium.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You slip away from the gathering, footsteps muffled on the concrete. The murmurs fade but the weight of your decision lingers in your chest.",
          "emotional_tone": "detached",
          "body_language": "You turn swiftly, shoulders tense as you leave.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": -1
          },
          "next_situation_id": "atrium_uprising_aftermath",
          "internal_hint": "Player avoids immediate action, reducing knowledge.",
          "internal_justification": "Allows player to defer involvement at cost of insight."
        },
        {
          "id": "interrupt_and_challenge_mistrust",
          "text": "Call out gently to the Open Blocks member to break the silence and reduce suspicion.",
          "dialogue_response": "I don’t mean to cause trouble—what's the mood here? Seems like something’s brewing.",
          "choice_type": "dialogue",
          "player_perspective": "Your voice cuts through the murmur; the Open Blocks member stiffens, then relaxes slightly, eyes wary but curious. The tension in the air momentarily shifts to cautious engagement.",
          "emotional_tone": "diplomatic",
          "body_language": "You hold your hands open uncrossed, maintaining soft eye contact.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "tentative_trust_open_blocks",
              "type": "status",
              "description": "Gained tentative trust from Open Blocks member.",
              "stat_mods": {
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "atrium_open_blocks_dialogue",
          "internal_hint": "Player attempts to reduce tension and build rapport cautiously.",
          "internal_justification": "Allows player to establish a foothold in a tense social dynamic through non-confrontational dialogue."
        },
        {
          "id": "nod_and_raise_eyebrow_signal_interest",
          "text": "Use subtle non-verbal signals to indicate your interest without speaking.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You nod slightly, raising an eyebrow toward the woman from Open Blocks. She catches the signal, a flicker of approval crossing her face, then gestures for you to come closer.",
          "emotional_tone": "subtle",
          "body_language": "You keep your posture relaxed but lean in slightly, locking eyes briefly.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_info_shared",
          "internal_hint": "Player uses body language to quietly communicate intent.",
          "internal_justification": "Enables non-verbal interaction that respects the cautious, secretive atmosphere."
        },
        {
          "id": "quietly_scan_crowd_for_facial_expressions",
          "text": "Observe the crowd's faces and microexpressions to gauge deeper emotions.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You focus on microexpressions—a clenched jaw here, a twitching eye there—picking up on fear, anger, and cautious hope. A subtle tension curves through the collective moods like an electric current.",
          "emotional_tone": "observant",
          "body_language": "You tilt your head slightly, eyes narrowing with concentration.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "atrium_uprising_info_gathered",
          "internal_hint": "Player invests in detailed social observation to enhance understanding.",
          "internal_justification": "Deepens environmental awareness and narrative immersion."
        },
        {
          "id": "steer_conversation_towards_open_blocks_goals",
          "text": "Gently steer the conversation to clarify the Open Blocks' plans to test trust.",
          "dialogue_response": "Help me understand—what’s the key move that changes the game tonight?",
          "choice_type": "dialogue",
          "player_perspective": "Her eyes flicker with surprise, then resolve. She leans in closer and speaks with quiet conviction. You can feel the weight of her words shape your understanding of the uprising.",
          "emotional_tone": "inquisitive",
          "body_language": "Your hands gesture subtly to invite openness without pressure.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2,
            "savvy": 1
          },
          "next_situation_id": "atrium_uprising_info_shared",
          "internal_hint": "Player probes for specific details to deepen engagement.",
          "internal_justification": "Helps reveal narrative details and NPC motivations."
        },
        {
          "id": "inner_reaction_steeling_resolve",
          "text": "Mentally prepare yourself, steeling resolve despite rising anxiety.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "Your chest tightens as you absorb the unrest—but you steady yourself, tightening your grip on your hidden resolve. You will not be a bystander when the city shifts to chaos.",
          "emotional_tone": "determined",
          "body_language": "You take a slow steadying breath, straightening your shoulders in silent defiance.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "steady_nerves",
              "type": "status",
              "description": "Gained calm focus amidst social tension.",
              "stat_mods": {
                "tenacity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_observer",
          "internal_hint": "Player focuses on internal emotional management.",
          "internal_justification": "Adds psychological depth and sets up for future high-pressure choices."
        },
        {
          "id": "gesture_pull_back_and_signal_caution",
          "text": "Non-verbally signal the Open Blocks member that you need to stay cautious for now.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You subtly raise a hand, palm outward, a silent plea for patience. The woman’s gaze lingers on you with a hint of disappointment but also understanding.",
          "emotional_tone": "cautious",
          "body_language": "You retreat a step with an apologetic tilt of your head.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 0
          },
          "next_situation_id": "atrium_uprising_observer",
          "internal_hint": "Player prioritizes self-preservation over immediate trust.",
          "internal_justification": "Creates realistic social dynamic with mixed trust."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    },
    "atrium_uprising_cynical_interjection": {
      "id": "atrium_uprising_cynical_interjection",
      "title": "In a moment of rising fervor, you voice your doubts about the uprising's prospects. The woman who invited you stiffens, tension flickering across her features as the crowd’s buzz dims into uncertain whispers. Some rebel faces show hardened resolve, others flicker with unease.",
      "description": "In a moment of rising fervor, you voice your doubts about the uprising's prospects. The woman who invited you stiffens, tension flickering across her features as the crowd’s buzz dims into uncertain whispers. Some rebel faces show hardened resolve, others flicker with unease.",
      "choices": [
        {
          "id": "double_down_on_cynicism",
          "text": "I’ve seen too many uprisings turn into a cage rather than freedom.",
          "dialogue_response": "I’ve seen too many uprisings turn into a cage rather than freedom.",
          "choice_type": "dialogue",
          "player_perspective": "Whispers ripple through the crowd; some nod in agreement while others narrow their eyes at you. The woman’s jaw tightens, but she doesn’t interrupt.",
          "emotional_tone": "resigned",
          "body_language": "You cross your arms, gaze hardening with experience.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "cynical_about_rebellion",
              "type": "status",
              "description": "Harbors doubts about the effectiveness of The Open Blocks’ uprising.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "savvy": -1
          },
          "next_situation_id": "atrium_uprising_reaction_to_cynicism",
          "internal_hint": "Player amplifies skepticism, deepening internal conflict.",
          "internal_justification": "Creates narrative friction and character complexity."
        },
        {
          "id": "soften_tone",
          "text": "Maybe I’m just scared of what this all means, but I want to help.",
          "dialogue_response": "Maybe I’m just scared of what this all means, but I want to help.",
          "choice_type": "dialogue",
          "player_perspective": "Her expression softens slightly, a flicker of understanding passing through the tension. The crowd’s whispers quiet to murmurs of empathy.",
          "emotional_tone": "vulnerable",
          "body_language": "You lower your gaze briefly, breathing slower.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [
            "cynical_about_rebellion"
          ],
          "stat_changes": {
            "integrity": -1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_rebuilding_trust",
          "internal_hint": "Player expresses vulnerability and desire to stay involved.",
          "internal_justification": "Allows for narrative repair and character growth."
        },
        {
          "id": "redirect_to_action",
          "text": "Words won't save us. We need to act now, or we lose everything.",
          "dialogue_response": "Words won't save us. We need to act now, or we lose everything.",
          "choice_type": "dialogue",
          "player_perspective": "Murmurs shift back toward urgency. The woman nods sharply. Energy reignites at your challenge.",
          "emotional_tone": "urgent",
          "body_language": "You lean in, voice cutting through the doubts.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [
            "cynical_about_rebellion"
          ],
          "stat_changes": {
            "insight": -1,
            "tenacity": 2
          },
          "next_situation_id": "atrium_uprising_preparation",
          "internal_hint": "Player renews commitment, turning skepticism into action.",
          "internal_justification": "Shifts narrative toward mobilization and momentum."
        },
        {
          "id": "interrupt_with_question",
          "text": "What concrete plans do we have? We can’t afford blind hope.",
          "dialogue_response": "What concrete plans do we have? We can’t afford blind hope.",
          "choice_type": "dialogue",
          "player_perspective": "Your voice pierces the brewing doubts, demanding specifics. The woman hesitates, then steadies herself, eyes darting to others seeking support.",
          "emotional_tone": "challenging",
          "body_language": "You raise a finger slightly, eyebrows furrowed in inquiry.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "demand_for_clarity",
              "type": "status",
              "description": "Insists on clear plans and actionable steps.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "integrity": 0
          },
          "next_situation_id": "atrium_uprising_detail_discussion",
          "internal_hint": "Player presses for clarity and actionable plans.",
          "internal_justification": "Encourages exposition and deepens strategic narrative."
        },
        {
          "id": "nod_in_silence",
          "text": "You say nothing but nod, letting the tension hang heavy.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You remain silent, your steady nod speaking volumes. The woman glances at you, uncertain if it’s agreement or doubt.",
          "emotional_tone": "calm",
          "body_language": "You keep your face impassive, nodding slowly.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "subtle_support",
              "type": "status",
              "description": "Shows quiet solidarity without words.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1
          },
          "next_situation_id": "atrium_uprising_silent_approval",
          "internal_hint": "Non-verbal communication that builds trust.",
          "internal_justification": "Allows player to influence mood without dialogue."
        },
        {
          "id": "inspect_woman_reactions",
          "text": "You quietly scan the crowd and the woman’s eyes for hidden reactions.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your gaze flicks subtly across the faces, looking for fear, doubt, or conspiracy. You catch a quick twitch at her lips, a flicker of worry beneath her steely exterior.",
          "emotional_tone": "curious",
          "body_language": "You narrow your eyes slightly, lips tightening in focus.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "keen_observer",
              "type": "status",
              "description": "Gained insight into emotional and social undercurrents.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "atrium_uprising_understand_mood",
          "internal_hint": "Player gathers subtle social cues to inform next moves.",
          "internal_justification": "Supports nuanced roleplaying and decision making."
        },
        {
          "id": "gesture_for_calm",
          "text": "You raise a calming hand, urging the crowd to steady before rash words.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You lift your hand slowly, fingers extended, signaling steady now. The crowd’s murmur lowers, tension easing in your wake as some take comfort in your control.",
          "emotional_tone": "calming",
          "body_language": "Your expression softens, brows relaxing as you make a slow lifting gesture.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "crowd_calm",
              "type": "status",
              "description": "Eases social tension among rebels.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": 1
          },
          "next_situation_id": "atrium_uprising_calm_after_tension",
          "internal_hint": "Player diffuses tension non-verbally.",
          "internal_justification": "Allows manipulation of social atmosphere."
        },
        {
          "id": "express_anger_at_vextros",
          "text": "This city is chained by Vextros. Our fight is the spark they fear.",
          "dialogue_response": "This city is chained by Vextros. Our fight is the spark they fear.",
          "choice_type": "dialogue",
          "player_perspective": "You voice sharp disdain, eyes burning with anger towards the true enemy. The woman’s eyes flash with renewed fire, the crowd’s energy shifting to defiant resolve.",
          "emotional_tone": "defiant",
          "body_language": "You clench your fists visibly, stance firm and confrontational.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [
            {
              "id": "anti_vextros_resolve",
              "type": "status",
              "description": "Reinforces collective hate and resolve against Vextros.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 2,
            "integrity": 1
          },
          "next_situation_id": "atrium_uprising_fueled_by_anger",
          "internal_hint": "Player strengthens anti-corporate sentiment in crowd.",
          "internal_justification": "Deepens factional conflict and motivation."
        },
        {
          "id": "self_check_vulnerability",
          "text": "You quietly admit your fear but hint at your hope.",
          "dialogue_response": "I won’t lie; I’m scared. But I can’t back down now.",
          "choice_type": "dialogue",
          "player_perspective": "You lower your gaze, voice softer yet firm. A few in the crowd nod appreciatively, sensing the honesty beneath your fear.",
          "emotional_tone": "honest",
          "body_language": "Your shoulders slump slightly, then square as you meet eyes again.",
          "requirements": {
            "ally_open_blocks": 1
          },
          "attributes_gained": [],
          "attributes_lost": [
            "cynical_about_rebellion"
          ],
          "stat_changes": {
            "integrity": -1,
            "tenacity": 2
          },
          "next_situation_id": "atrium_uprising_honest_confession",
          "internal_hint": "Player reveals vulnerability to regain trust.",
          "internal_justification": "Fosters empathy and narrative depth."
        }
      ],
      "stat_requirements": {
        "ally_open_blocks": 1
      },
      "attribute_requirements": null,
      "consequences": {
        "stat_changes": "Integrity, tenacity, and savvy affected by player tone.",
        "cynical_about_rebellion": "Creates social friction and internal doubts impacting future interactions."
      },
      "is_bridge_node": true,
      "next_situations": [
        "Integrity, tenacity, and savvy affected by player tone.",
        "Creates social friction and internal doubts impacting future interactions."
      ]
    },
    "arc1_root_situation": {
      "id": "arc1_root_situation",
      "title": "In a dimly lit café nestled within the labyrinthine alleys of Crescent Center's 20th Atrium, Sierra Violet meets with Roxy, a savvy fixer from The Open Blocks known for her access to contraband PHQ-9 and insider whispers about Vextros corruption. Their whispered conversation balances on a knife-edge as nearby patrons cast wary glances, knowing the café’s open-block patrons harbor more than just stories—they carry grudges. Roxy leans in, voice low. 'Vextros is poisoning more than just Nutrax these days. Got word their PHQ-9 supplies are laced, making users dependent. You sure you want to paw into that hornet’s nest?'",
      "description": "In a dimly lit café nestled within the labyrinthine alleys of Crescent Center's 20th Atrium, Sierra Violet meets with Roxy, a savvy fixer from The Open Blocks known for her access to contraband PHQ-9 and insider whispers about Vextros corruption. Their whispered conversation balances on a knife-edge as nearby patrons cast wary glances, knowing the café’s open-block patrons harbor more than just stories—they carry grudges. Roxy leans in, voice low. 'Vextros is poisoning more than just Nutrax these days. Got word their PHQ-9 supplies are laced, making users dependent. You sure you want to paw into that hornet’s nest?'",
      "choices": [
        {
          "id": "choice1_probe_phq9",
          "text": "Press Roxy for details on Vextros’s PHQ-9 tampering.",
          "dialogue_response": "\"Tell me exactly what you mean by 'laced'. How deep does their control run?\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy’s eyes flash as she lowers her voice. 'It’s subtle—chemical tweaks that increase addiction but lower efficacy. If people don’t get their fix regularly, they crash hard. Vextros keeps ’em hooked and desperate. Some say it’s a surveillance tool, too — monitor dependence, control compliance.'",
          "emotional_tone": "determined, probing",
          "body_language": "Leaning forward, eyes locked intently on Roxy’s face.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_investigation_phq9",
          "internal_hint": "Expands player knowledge on corporate corruption and PHQ-9 addiction.",
          "internal_justification": "This choice deepens Sierra’s understanding of Vextros’ nefarious reach, providing context for sabotage and resistance."
        },
        {
          "id": "choice2_express_caution",
          "text": "Caution Roxy about rash moves that might backfire.",
          "dialogue_response": "\"We have to be smart. Body count and blowback won’t help anyone.\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy nods but frowns, ‘Smart’s good, but slow means they never change. If we don’t shake the system now, the cracks will only deepen.’",
          "emotional_tone": "measured, wary",
          "body_language": "Hands folded tightly in lap, face sober.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": -1,
            "insight": 1
          },
          "next_situation_id": "arc1_strategy_discussion",
          "internal_hint": "Highlights tension between cautious and aggressive approaches to rebellion.",
          "internal_justification": "This choice sets an alternative path favoring patience and calculation over immediate confrontation."
        },
        {
          "id": "choice3_demand_open_blocks_help",
          "text": "Push for The Open Blocks to mobilize openly against Vextros.",
          "dialogue_response": "\"It’s time we rally the Blocks and hit Vextros where it hurts. They’ve bled us long enough.\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy’s grin is sharp and brief. ‘Loud and dirty, huh? Could stir a hornets’ nest, but the Blocks respect guts. You ready for that fire?’",
          "emotional_tone": "defiant, bold",
          "body_language": "Slams fist lightly on the tabletop, eyes blazing.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "grudge_mobilized",
              "type": "status",
              "description": "Sierra’s grudge fuels an incipient alliance with The Open Blocks.",
              "stat_mods": null
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "might": 1
          },
          "next_situation_id": "arc1_open_blocks_rally",
          "internal_hint": "Launches potential faction alliance and direct conflict path.",
          "internal_justification": "This option propels the narrative into factional tensions and grassroots rebellion under Sierra's leadership."
        },
        {
          "id": "choice4_inquire_about_project_sunset",
          "text": "Ask about Project Sunset’s role in the conflict.",
          "dialogue_response": "\"What’s Project Sunset got to do with all this chaos?\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy’s face darkens. ‘They’re the ghost in the machine—Vextros’s rival and secret shadow. Their tech’s wild, and their pushback against Vextros is real, but messy. Getting tangled with their secrets could get us killed or change the game entirely.’",
          "emotional_tone": "curious, cautious",
          "body_language": "Eyebrows raised, tilting head slightly.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1,
            "savvy": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation",
          "internal_hint": "Introduces Project Sunset’s secretive faction into the arc.",
          "internal_justification": "This choice opens up intrigue regarding faction rivalries and deepens narrative complexity."
        },
        {
          "id": "choice5_interrupt_with_skepticism",
          "text": "Cut Roxy off with skepticism about her sources.",
          "dialogue_response": "\"Hold on — how sure are you about this? Sounds like a rumor designed to scare the weak.\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy’s eyes narrow sharply. ‘Rumor? I wish it was. These come from deep within the Blocks and smuggled docs. But belief or not, silence is how they win.’",
          "emotional_tone": "skeptical, challenging",
          "body_language": "Eyes narrowed, leaning back with one brow raised.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1
          },
          "next_situation_id": "arc1_root_situation",
          "internal_hint": "Tests Roxy's credibility and player's trust in insider information.",
          "internal_justification": "Allows player to challenge NPC credibility, affecting trust and information flow in future."
        },
        {
          "id": "choice6_nonverbal_reaction_uneasy",
          "text": "Show quiet unease, avoiding words.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "You wrinkle your nose slightly, eyes flicking to the shadowed corners of the café. The weight of dependency and manipulation settles coldly in your gut, but you keep silent, weighing the risks.",
          "emotional_tone": "anxious, reserved",
          "body_language": "Pressed lips, shifting fingers restlessly on the table.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "arc1_root_situation",
          "internal_hint": "Expresses internal doubt and caution without speaking.",
          "internal_justification": "Provides subtlety in roleplay, allowing player to convey emotion non-verbally and build internal tension."
        },
        {
          "id": "choice7_steer_toward_alliance_building",
          "text": "Suggest reaching out to other distrustful factions.",
          "dialogue_response": "\"We can't fight Vextros alone. Maybe it's time to bring the smaller dissenters together—Phobos, Sunset sympathizers. Strength in numbers.\"",
          "choice_type": "dialogue",
          "player_perspective": "Roxy contemplates briefly, nodding slowly. ‘Coalitions are tricky but necessary. Could be the edge we need, if we can handle the politics.’",
          "emotional_tone": "strategic, inclusive",
          "body_language": "Hands tented thoughtfully, maintaining steady eye contact.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_alliance_plot",
          "internal_hint": "Opens path for diplomatic faction interactions.",
          "internal_justification": "Encourages player to explore complex faction dynamics and alliance-building."
        },
        {
          "id": "choice8_investigate_local_phq9_source",
          "text": "Discreetly inspect the dataslate Roxy slid over.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your fingers brush the dataslate’s smooth surface, double-checking files for anomalies or sources hinting at PHQ-9 contamination. Every byte could be a lead or a trap.",
          "emotional_tone": "focused, cautious",
          "body_language": "Subtle glance down, brows furrowed in concentration.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1,
            "savvy": 1
          },
          "next_situation_id": "arc1_investigation_phq9",
          "internal_hint": "Allows gathering concrete evidence during conversation.",
          "internal_justification": "Introduces micro-interaction enriching investigative gameplay flavor."
        },
        {
          "id": "choice9_emotional_outburst",
          "text": "Let your anger show openly, risking calm talk.",
          "dialogue_response": "\"They’ve been poisoning us and keeping us slaves to their drugs for too long! Enough hiding. We fight now!\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice raises, steady and fiery, catching a few glances. Roxy’s expression shifts between admiration and concern, sensing the volatility but also the raw passion.",
          "emotional_tone": "angry, impassioned",
          "body_language": "Hands clenched into fists on the table, leaning aggressively forward.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "might": 1,
            "tenacity": 1,
            "insight": -1
          },
          "next_situation_id": "arc1_open_blocks_rally",
          "internal_hint": "Portrays emotional investment and risk of impulsiveness.",
          "internal_justification": "Enables roleplay of emotional expression, showing consequences on interpersonal relations and tactical wisdom."
        },
        {
          "id": "choice10_read_room_for_allies",
          "text": "Observe surrounding patrons for potential allies or threats.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "Your gaze scans the room, noting the guarded postures and flickers of recognition between patrons. Allies in the shadows, or eyes of informants? The balance could tip with a nod or a step aside.",
          "emotional_tone": "alert, calculating",
          "body_language": "Eyes sweeping cautiously, fingers tapping lightly against the dataslate edge.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "arc1_root_situation",
          "internal_hint": "Micro-social awareness, gathering ambient intelligence.",
          "internal_justification": "Adds depth to the social setting, allowing player to detect allies or threats beyond direct conversation."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    },
    "arc1_investigation_phq9_1": {
      "id": "arc1_investigation_phq9_1",
      "title": "Roxy leans closer, her voice dropping to a wary whisper as the hum of the café fades into the background. \"You know, the stuff Vextros pumps into their PHQ-9—it's more than just addictive chemicals. They've rigged the dosage to keep people frantic for refills. And the surveillance tags embedded in every cartridge? It's how they track every user, every movement, like a spider’s web.\"",
      "description": "Roxy leans closer, her voice dropping to a wary whisper as the hum of the café fades into the background. \"You know, the stuff Vextros pumps into their PHQ-9—it's more than just addictive chemicals. They've rigged the dosage to keep people frantic for refills. And the surveillance tags embedded in every cartridge? It's how they track every user, every movement, like a spider’s web.\"",
      "choices": [
        {
          "id": "arc1_investigation_phq9_1_challenge",
          "text": "\"That's downright inhuman. How are we supposed to fight something that controls our own bodies?\"",
          "dialogue_response": "\"Exactly. But knowing their game is step one. Break the supply, disrupt the data. Make their puppets cut their own strings.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice barely hides the anger simmering beneath. Roxy nods approvingly, sensing your fire.",
          "emotional_tone": "defiant, rallying",
          "body_language": "Clenched fists resting on the table, eyes burning with resolve.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player expresses outrage and desire to resist PHQ-9 control.",
          "internal_justification": "This choice emphasizes Sierra’s fighting spirit and willingness to take on Vextros’s control mechanisms."
        },
        {
          "id": "arc1_investigation_phq9_1_calm",
          "text": "\"We’ll have to be smart about this. Catching them off guard means using their own tech against them.\"",
          "dialogue_response": "\"Yeah. A precise strike, not a storming raid. You’ve got the brains for this; I like that.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your tone is level, signaling calculated purpose. Roxy relaxes a fraction, respecting your pragmatism.",
          "emotional_tone": "calm, strategic",
          "body_language": "Fingers lightly tapping on the dataslate, thoughtful expression.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 2
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player adopts cautious, strategic mindset towards sabotage.",
          "internal_justification": "Balances the narrative with a calculated alternative to direct confrontation."
        },
        {
          "id": "arc1_investigation_phq9_1_silent",
          "text": "Remain silent, letting Roxy finish without interruption.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You stay quiet, absorbing every whispered detail. Roxy’s tension is palpable; your silence offers space for her to trust.",
          "emotional_tone": "silent, receptive",
          "body_language": "Leaning back slightly, hands folded, attentive gaze.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player allows informant to share fully, building trust.",
          "internal_justification": "Provides a non-verbal choice that deepens relationship via attentive listening."
        },
        {
          "id": "arc1_investigation_phq9_1_interrupt",
          "text": "Interrupt quickly, raising your voice slightly: \"Wait, listen. If those tags can track users, can we hack them to feed false info?\"",
          "dialogue_response": "\"Hold up, before you go on. If those cartridges have surveillance tags, maybe we can turn 'em to our advantage. False data, fake users. It's a way in.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your sudden interjection cuts through the tension, catching Roxy off guard but piquing her interest. She blinks and nods, intrigued by your quick thinking.",
          "emotional_tone": "energetic, impulsive",
          "body_language": "Eyes wide, leaning forward abruptly, voice raised slightly.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "quick_thinker",
              "type": "status",
              "description": "Recognized for quick mind during conversation.",
              "stat_mods": {
                "savvy": 1,
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player interrupts to steer conversation towards a hacking opportunity.",
          "internal_justification": "Demonstrates character's quick wit and willingness to actively guide discussions."
        },
        {
          "id": "arc1_investigation_phq9_1_doubt",
          "text": "Frown subtly, voice lowered: \"Are we sure this isn't just conspiracy? Vextros is powerful, but is this really that deep?\"",
          "dialogue_response": "\"I get the risk of jumping to conclusions, but the patterns don't lie. The way PHQ-9 pushes repeat use—they’ve engineered dependency deliberately.\"",
          "choice_type": "dialogue",
          "player_perspective": "You show a flicker of uncertainty, trying to digest the magnitude of the claim. Roxy meets your gaze firmly, her resolve unwavering.",
          "emotional_tone": "skeptical, cautious",
          "body_language": "Brows furrowed, lips pressed tight, head tilted slightly in doubt.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "cautious_inquiry",
              "type": "status",
              "description": "You question claims carefully, building credibility.",
              "stat_mods": {
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player voices doubt to encourage Roxy to provide stronger evidence.",
          "internal_justification": "Adds realism by exploring the player's hesitation and pushes NPC to explain further."
        },
        {
          "id": "arc1_investigation_phq9_1_reassure",
          "text": "Nod carefully, soft smile: \"This might be dark, but knowing they’re watching means we’re not powerless. We can outsmart their web.\"",
          "dialogue_response": "\"Right. Awareness is our weapon. Their control is only as good as the ignorance they foster. We have to use that to break free.\"",
          "choice_type": "dialogue",
          "player_perspective": "You offer a steady, calm assurance. Roxy’s posture eases, a grateful smile touching her lips as hope flickers in her eyes.",
          "emotional_tone": "hopeful, empathetic",
          "body_language": "Relaxed shoulders, gentle eye contact, small reassuring nod.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player calms and encourages, strengthening alliance.",
          "internal_justification": "Demonstrates leadership and builds trust through empathy."
        },
        {
          "id": "arc1_investigation_phq9_1_investigate",
          "text": "Slide your hand subtly towards Roxy’s dataslate, voice low: \"Mind if I take a closer look at those logs? Something might be hiding in the data patterns.\"",
          "dialogue_response": "\"If you’re up for it, I can dig through the datastream for anomalies—maybe we’ll find weak points in their tracking.\"",
          "choice_type": "investigation",
          "player_perspective": "Your fingers hover near Roxy’s device, signaling your readiness to assist actively. She hesitates, then offers you tentative trust, letting you access the data.",
          "emotional_tone": "curious, proactive",
          "body_language": "Reaching out calmly but deliberately, eyes locking with hers to seek permission.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1,
            "savvy": 1
          },
          "next_situation_id": "arc1_investigation_phq9_2",
          "internal_hint": "Player initiates direct investigative action during discussion.",
          "internal_justification": "Encourages active problem-solving and deepens collaboration."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    },
    "arc1_strategy_discussion_1": {
      "id": "arc1_strategy_discussion_1",
      "title": "Roxy sighs, rolling a cigarette expertly between her fingers. \"You’re right to worry about blowback, Sierra. These blocks can burn fast, but a wildfire swallows everyone if we’re not careful. The shadows are stiff with eyes; any wrong move and the whole neighborhood chokes.\" She taps ash into a cracked glass ashtray.",
      "description": "Roxy sighs, rolling a cigarette expertly between her fingers. \"You’re right to worry about blowback, Sierra. These blocks can burn fast, but a wildfire swallows everyone if we’re not careful. The shadows are stiff with eyes; any wrong move and the whole neighborhood chokes.\" She taps ash into a cracked glass ashtray.",
      "choices": [
        {
          "id": "arc1_strategy_discussion_1_reassure",
          "text": "\"I get it. We move like ghosts — strike quick, vanish faster. No noise, no bodies.\"",
          "dialogue_response": "\"That’s what keeps the Blocks alive. Ghosts and grit. You’re learning.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your calm assurance steadies the air between you. Roxy’s lips twitch in a half-smile, respect blooming.",
          "emotional_tone": "reassuring, steady",
          "body_language": "Slow nod, hands open in a relaxed gesture.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1,
            "tenacity": -1
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player adopts stealthy approach to avoid reckless violence.",
          "internal_justification": "Supports narrative tension between cautious and bold activism."
        },
        {
          "id": "arc1_strategy_discussion_1_argument",
          "text": "\"Sometimes ghosts have to roar. Waiting lets Vextros tighten its grip.\"",
          "dialogue_response": "\"And sometimes ghosts get caught in the flames they start. Recklessness can kill more than Vextros ever will.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your words cut through the smoke, carrying raw urgency. Roxy’s eyes narrow—respect tangled with wariness.",
          "emotional_tone": "aggressive, urgent",
          "body_language": "Leaning forward, voice low but fierce.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 2,
            "insight": -1
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player pushes for immediate bold action at some risk.",
          "internal_justification": "Emphasizes internal conflict over strategies of rebellion."
        },
        {
          "id": "arc1_strategy_discussion_1_question",
          "text": "\"What’s the biggest risk we haven’t seen yet?\"",
          "dialogue_response": "\"That’s the thing—Vextros’s reach feels endless till it snaps all at once. But when it does, it’ll scream louder than any siren.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your question hangs in the air. Roxy’s eyes cloud with memories of scars and failures — warnings born from experience.",
          "emotional_tone": "curious, cautious",
          "body_language": "Furrowed brow, clasping hands nervously.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player probes for insight about hidden dangers.",
          "internal_justification": "Advances narrative by building awareness of unseen threats."
        },
        {
          "id": "arc1_strategy_discussion_1_interrupt",
          "text": "Interrupt to steer the conversation: \"But if we hesitate, what good are we? We can’t afford to be ghosts forever.\"",
          "dialogue_response": "You cut in sharply, voice firm. Roxy blinks, momentarily startled, then considers your push—her jaw tightens.",
          "choice_type": "dialogue",
          "player_perspective": "Your sudden interjection shifts the mood. Roxy’s gaze flares with a mix of challenge and grudging agreement.",
          "emotional_tone": "assertive, challenging",
          "body_language": "Eyes sharp, posture straight and unyielding.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "assertiveness_boost",
              "type": "status",
              "description": "Boost to assertiveness from taking charge in conversation.",
              "stat_mods": {
                "tenacity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "insight": -1
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player interrupts to steer discussion towards bolder tactics.",
          "internal_justification": "Introduces tension by challenging cautious approach."
        },
        {
          "id": "arc1_strategy_discussion_1_assess_environment",
          "text": "Quietly scan the room for listening devices before replying.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your eyes flicker around corners and vents, tension sharpening your senses. No obvious bugs, but the stale air feels heavier—as if shadows themselves listen.",
          "emotional_tone": "focused, vigilant",
          "body_language": "Subtle head turns and narrowed eyes, a slight lean toward the walls.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "alertness",
              "type": "status",
              "description": "Heightened awareness of surroundings after careful scanning.",
              "stat_mods": {
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {},
          "next_situation_id": "arc1_strategy_discussion_1",
          "internal_hint": "Player takes cautious step to uncover potential surveillance.",
          "internal_justification": "Enhances immersion with micro-investigative actions and builds tension about security."
        },
        {
          "id": "arc1_strategy_discussion_1_nonverbal_boast",
          "text": "Flash a confident smirk and tap your implant port subtly.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "Your confident smirk and subtle tap on your implant port send a clear message: you’re ready and wired for whatever comes. Roxy’s eyes flash with impressed surprise.",
          "emotional_tone": "confident, defiant",
          "body_language": "Smirk, casual tap to implant with a relaxed wrist flick.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "tech_confidence",
              "type": "status",
              "description": "Confidence in technological edge gained through interaction.",
              "stat_mods": {
                "expertise": 1,
                "savvy": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {},
          "next_situation_id": "arc1_strategy_discussion_1",
          "internal_hint": "Player subtly signals technological readiness and builds rapport.",
          "internal_justification": "Adds depth to character interaction with non-verbal micro-communication."
        },
        {
          "id": "arc1_strategy_discussion_1_emotional_reaction",
          "text": "Suppress a bitter laugh and mutter, \"Sometimes, it feels like we’re ghosts trapped in a cage.\"",
          "dialogue_response": "\"Yeah,\" Roxy says quietly, the fire in her eyes dimming for a heartbeat. \"That cage is cage enough to break most. But not us. Not yet.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your bitter laughter hangs in the smoky gloom, vulnerability flickering behind your eyes. Roxy’s expression softens, a fragile camaraderie forming between you.",
          "emotional_tone": "melancholic, vulnerable",
          "body_language": "Shaking head slightly, shoulders sag momentarily.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "emotional_bond",
              "type": "status",
              "description": "Strengthened bond through shared vulnerability.",
              "stat_mods": {
                "integrity": 1,
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player shows vulnerability to deepen relationship.",
          "internal_justification": "Creates emotional stakes and helps build trust with Roxy."
        },
        {
          "id": "arc1_strategy_discussion_1_probe_motivation",
          "text": "\"What made you fight this hard, Roxy? Why risk it all for ghosts?\"",
          "dialogue_response": "\"Because ghosts remember the people who built these Blocks with their blood and sweat. I owe them that much—and more. You’ll see, Sierra.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your question cuts through the smoke, momentarily peeling away Roxy’s usual guarded demeanor. Her eyes glint with quiet passion and stubborn hope.",
          "emotional_tone": "curious, warm",
          "body_language": "Leaning in, brows raised, voice softer and inviting.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "relationship_rise",
              "type": "status",
              "description": "Improved relationship with Roxy through personal inquiry.",
              "stat_mods": {
                "insight": 2,
                "integrity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2,
            "integrity": 1
          },
          "next_situation_id": "arc1_strategy_discussion_2",
          "internal_hint": "Player deepens relationship with Roxy by probing personal motivation.",
          "internal_justification": "Builds character depth and strengthens bonds."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    },
    "arc1_open_blocks_rally_1": {
      "id": "arc1_open_blocks_rally_1",
      "title": "Roxy’s grin sharpens, her usual easy cynicism edged with adrenaline. \"You wanna rattle cages and wake hornets? Alright. The Blocks don’t back down, especially not for folks with guts like you. But it’s a dance on a razorblade, Sierra. They’ll want to hear your pitch, see your spark. You ready to light this up?\"",
      "description": "Roxy’s grin sharpens, her usual easy cynicism edged with adrenaline. \"You wanna rattle cages and wake hornets? Alright. The Blocks don’t back down, especially not for folks with guts like you. But it’s a dance on a razorblade, Sierra. They’ll want to hear your pitch, see your spark. You ready to light this up?\"",
      "choices": [
        {
          "id": "arc1_open_blocks_rally_1_challenge",
          "text": "\"I’m not just ready. I’m hungry. Let’s drag their lies into daylight.\"",
          "dialogue_response": "\"Now that’s the fire I want to see. Let’s bring the Blocks to your side, and watch Vextros choke on their own poison.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice cracks like thunder. Roxy’s grin widens into a feral smile, the moment charged with fierce possibility.",
          "emotional_tone": "bold, aggressive",
          "body_language": "Slamming a fist on the tabletop, posture upright, blazing eyes.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "open_blocks_ally",
              "type": "status",
              "description": "Secured tentative alliance with The Open Blocks.",
              "stat_mods": {
                "might": 1,
                "tenacity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "might": 2,
            "tenacity": 1
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player commits to aggressive mobilization of Open Blocks.",
          "internal_justification": "Catalyzes faction alliance and escalates conflict with Vextros."
        },
        {
          "id": "arc1_open_blocks_rally_1_reserve",
          "text": "\"I need more time to earn their trust. We start small, keep it quiet.\"",
          "dialogue_response": "\"Smart thinking. Even the loudest roar begins as a whisper. We’ll craft our steps, slow and sure.\"",
          "choice_type": "dialogue",
          "player_perspective": "You soften your tone, scanning Roxy’s face for signs of doubt. Her nod confirms wary support.",
          "emotional_tone": "cautious, measured",
          "body_language": "Fingers tracing the rim of your glass, eyes steady but calm.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "open_blocks_caution",
              "type": "status",
              "description": "Adopted a cautious approach to faction engagement.",
              "stat_mods": {
                "savvy": 1,
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "might": -1,
            "insight": 1,
            "savvy": 1
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player opts for cautious faction involvement.",
          "internal_justification": "Provides alternative path reflecting careful social maneuvering."
        },
        {
          "id": "arc1_open_blocks_rally_1_question",
          "text": "\"What do the Blocks expect in return? Nothing’s free in these parts.\"",
          "dialogue_response": "\"Loyalty, a clear target, and a spark to keep them fighting. Most want the corruption torn down, and they’ll bleed to make it happen, but respect goes both ways.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your tone sharpens, mindful of the cost. Roxy’s face grows serious, her gaze steady and frank.",
          "emotional_tone": "inquisitive, wary",
          "body_language": "Leaning in, elbows on the table, eyes narrowed.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player probes faction motives and expectations.",
          "internal_justification": "Builds nuanced faction relationship and narrative tension."
        },
        {
          "id": "arc1_open_blocks_rally_1_interrupt",
          "text": "Interrupt with a sharp laugh and a quick quip: \"And what if they send their thugs to dance? We don’t exactly do ballroom.\"",
          "dialogue_response": "\"You think Vextros is just gonna sit pretty while we build our storm? Let ‘em try—Open Blocks don’t flinch.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your laughter is sudden, cutting the tension like a blade. Roxy cocks her head, a spark of rebellious amusement lighting her eyes.",
          "emotional_tone": "defiant, cocky",
          "body_language": "Head tilted, smirking with a youthful spark of challenge.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "blocks_defiant",
              "type": "status",
              "description": "Elicited respect with defiant humor.",
              "stat_mods": {
                "allure": 1,
                "might": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "allure": 1,
            "might": 1
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player steers conversation with humor and defiance.",
          "internal_justification": "Deepens faction connection through personality, opens room for more dynamic dialogue."
        },
        {
          "id": "arc1_open_blocks_rally_1_silent_study",
          "text": "Observe Roxy silently, noting her signs of doubt or excitement before responding aloud.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "You narrow your gaze, watching the micro-expressions flicker across Roxy’s face—tightening jaw, the twitch of a smile. This quiet moment speaks volumes.",
          "emotional_tone": "observant, reserved",
          "body_language": "Eyes sharpening, slight lean forward, hands folded loosely.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "keen_observer",
              "type": "status",
              "description": "Gained insight from nonverbal cues.",
              "stat_mods": {
                "insight": 2
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 2
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player makes an investigative action to gauge faction mood.",
          "internal_justification": "Adds subtle social dynamics and prepares for informed negotiation."
        },
        {
          "id": "arc1_open_blocks_rally_1_emotional_reaction",
          "text": "Show a flicker of hesitation before steeling yourself to answer.",
          "dialogue_response": "\"The risk is real... but so is the fight inside me. They’ve made a mistake underestimating what I’m willing to pay.\"",
          "choice_type": "reaction",
          "player_perspective": "Your breath catches, eyes clouding briefly with doubt before clearing into fierce resolve. Roxy’s expression softens, a glint of respect beneath the adrenaline.",
          "emotional_tone": "vulnerable, resolute",
          "body_language": "Momentary falter, hands clenching then relaxing into strength.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "open_blocks_empath",
              "type": "status",
              "description": "Built emotional connection with faction through vulnerability.",
              "stat_mods": {
                "integrity": 1,
                "tenacity": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": 1
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player cultivates emotional depth to faction relationship.",
          "internal_justification": "Humanizes player character and strengthens faction bonds."
        },
        {
          "id": "arc1_open_blocks_rally_1_smooth_redirect",
          "text": "Change the subject tactfully towards recent events in Crescent Center, testing Roxy's knowledge and attitude.",
          "dialogue_response": "\"Speaking of poison, the Level 20 Atrium’s got rumors swirling. What’s your take on that unrest?\"",
          "choice_type": "dialogue",
          "player_perspective": "You slide the topic sideways, eyes searching hers for an unguarded flicker. Roxy’s lips twitch, a quiet acknowledgment of the larger chessboard in play.",
          "emotional_tone": "strategic, curious",
          "body_language": "Casual lean, hands open in a questioning gesture.",
          "requirements": {},
          "attributes_gained": [
            {
              "id": "blocks_informer",
              "type": "status",
              "description": "Gained faction insights by steering conversation.",
              "stat_mods": {
                "savvy": 1,
                "insight": 1
              }
            }
          ],
          "attributes_lost": [],
          "stat_changes": {
            "savvy": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_open_blocks_rally_2",
          "internal_hint": "Player probes faction intelligence and stance on external issues.",
          "internal_justification": "Expands narrative depth with social investigation."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    },
    "arc1_project_sunset_investigation_1": {
      "id": "arc1_project_sunset_investigation_1",
      "title": "Roxy's voice lowers further, darkening as if pulling shadows from a hidden well. \"Project Sunset? They're the real wild card in this mess — tech wizards and anarchists all rolled in one. Their experiments? Borderline madness. Their secret weapon? Nobody really knows. But Vextros fears them like hell. tangle with them, and you might find yourself caught between two blades.\"",
      "description": "Roxy's voice lowers further, darkening as if pulling shadows from a hidden well. \"Project Sunset? They're the real wild card in this mess — tech wizards and anarchists all rolled in one. Their experiments? Borderline madness. Their secret weapon? Nobody really knows. But Vextros fears them like hell. tangle with them, and you might find yourself caught between two blades.\"",
      "choices": [
        {
          "id": "arc1_project_sunset_investigation_1_probe",
          "text": "\"What kind of experiments? Something that could help us, or just another nightmare?\"",
          "dialogue_response": "\"A bit of both. They're messing with sentience, pushing implants far beyond what's safe. Some of their tech could dismantle Vextros’s grip — or wreck us all if it slips loose.\"",
          "choice_type": "dialogue",
          "player_perspective": "You press for answers, leaning in tight. Roxy’s eyes glitter with both hope and fear, shadows playing in their depths.",
          "emotional_tone": "curious, concerned",
          "body_language": "Eyes wide, voice lowered, posture alert.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1,
            "insight": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player seeks clarity on Project Sunset technology and risks.",
          "internal_justification": "Expands lore and builds tension about unknown faction capabilities and stakes."
        },
        {
          "id": "arc1_project_sunset_investigation_1_warn",
          "text": "\"Dealing with a mess like that... can cost more than we can afford. Maybe some lines shouldn't be crossed.\"",
          "dialogue_response": "\"Yeah, well, Vextros already crossed every damn line. Sometimes you gotta dirty your hands to clean the filth.\"",
          "choice_type": "dialogue",
          "player_perspective": "You voice your hesitation with heavy heart. Roxy’s eyes flash, heated but understanding.",
          "emotional_tone": "warned, conflicted",
          "body_language": "Fingers tapping nervously on the table, eyes flicking away momentarily.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": -1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player hesitates on aggressive engagement with Project Sunset.",
          "internal_justification": "Reflects character depth facing ethical and practical dangers."
        },
        {
          "id": "arc1_project_sunset_investigation_1_silence",
          "text": "Stay silent, eyes fixed on Roxy, processing her words.",
          "dialogue_response": null,
          "choice_type": "action",
          "player_perspective": "You stay quiet, every nanosecond stretching taut as you contemplate the dangerous web of faction rivalries. Roxy senses your steady attention.",
          "emotional_tone": "quiet, contemplative",
          "body_language": "Still and watchful, hands folded tightly in lap.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player absorbs heavy faction info silently.",
          "internal_justification": "Allows for reflection and relationship building via presence."
        },
        {
          "id": "arc1_project_sunset_investigation_1_interrupt",
          "text": "Interrupt sharply and demand, \"Why should we trust Project Sunset at all? They sound reckless.\"",
          "dialogue_response": "\"Because their recklessness might be the only thing challenging Vextros's chokehold. But that gamble could burn us all. It's a razor's edge.\"",
          "choice_type": "dialogue",
          "player_perspective": "You cut in abruptly, voice hardening as you challenge Roxy. She blinks, surprised but doesn't back down, her own gaze hardening like flint.",
          "emotional_tone": "aggressive, skeptical",
          "body_language": "Leaning forward, eyebrows tightly furrowed, voice clipped.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [
            "grudge"
          ],
          "stat_changes": {
            "integrity": -1,
            "tenacity": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player expresses distrust for Project Sunset to steer conversation.",
          "internal_justification": "Creates tension, tests Roxy's conviction, expands political dynamic."
        },
        {
          "id": "arc1_project_sunset_investigation_1_nonverbal_agreement",
          "text": "Nod slowly, eyes steady. Give a small thumbs-up.",
          "dialogue_response": null,
          "choice_type": "reaction",
          "player_perspective": "You give a subtle nod and a quick thumbs-up, showing you understand the stakes without needing words. Roxy’s tense features soften momentarily, sensing your silent support.",
          "emotional_tone": "supportive, calm",
          "body_language": "Slow nod with slight inhale, relaxed shoulders.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player shows nonverbal support to build trust with Roxy.",
          "internal_justification": "Develops trust and rapport without escalating conflict."
        },
        {
          "id": "arc1_project_sunset_investigation_1_subtle_probe",
          "text": "Lean in quietly and ask, \"Have you seen any of their tech firsthand? Anything we could use?\"",
          "dialogue_response": "\"Only bits and pieces, smuggled out by insiders. Some of it looks like science fiction — brain mesh interfaces, self-repairing circuits. But it’s dangerous, unstable. Handling it is like juggling live grenades.\"",
          "choice_type": "dialogue",
          "player_perspective": "You lean in close, voice dropping as you ask the question carefully. Roxy lowers her voice, eyes darting around before answering.",
          "emotional_tone": "inquisitive, cautious",
          "body_language": "Leaning forward, voice lowered, eyes narrowing slightly.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "expertise": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player attempts to glean concrete intelligence about Project Sunset tech.",
          "internal_justification": "Adds depth to investigation, setting stage for tech-related options."
        },
        {
          "id": "arc1_project_sunset_investigation_1_emotional_reaction",
          "text": "Show visible signs of fear and anxiety, voice wavering, \"This could all go very wrong, couldn’t it?\"",
          "dialogue_response": "\"It already has, a thousand times over. But fear won’t stop what’s coming. We either face it head-on or get crushed underfoot.\"",
          "choice_type": "dialogue",
          "player_perspective": "Your voice cracks slightly as you admit your fear. Roxy’s somber expression tells you she’s been there, felt that weight.",
          "emotional_tone": "vulnerable, anxious",
          "body_language": "Hands trembling slightly, breath shallow, eyes flickering nervously.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "integrity": 1,
            "tenacity": -1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player expresses emotional vulnerability about high stakes.",
          "internal_justification": "Humanizes player, deepens relationship with Roxy."
        },
        {
          "id": "arc1_project_sunset_investigation_1_investigative_glance",
          "text": "Glance quickly around the room, noting any surveillance devices or listening bugs.",
          "dialogue_response": null,
          "choice_type": "investigation",
          "player_perspective": "Your eyes scan the room deliberately, quickly picking out cameras and hidden mics. Roxy notices but doesn’t flinch, signaling you to be discreet.",
          "emotional_tone": "alert, cautious",
          "body_language": "Eyes sweeping, brief head turns, subtle finger taps.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "insight": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player checks for surveillance to assess dialogue risks.",
          "internal_justification": "Promotes player agency and realistic tension."
        },
        {
          "id": "arc1_project_sunset_investigation_1_light_humor",
          "text": "Attempt to lighten the mood with a slight smirk, \"Sounds like somebody’s cooking up more than tea over there.\"",
          "dialogue_response": "\"Yeah, ‘tea’ that could blow the whole city sky-high if we’re not careful. No jokes about it, kid.\"",
          "choice_type": "dialogue",
          "player_perspective": "You try to break the tension with a smirk and a joke. Roxy’s serious glare warns you the situation isn’t for laughs.",
          "emotional_tone": "wry, cautious",
          "body_language": "Lean back slightly, one eyebrow raised, faint grin.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "allure": 1,
            "tenacity": -1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player uses humor to manage tension, risking misunderstanding.",
          "internal_justification": "Adds personality nuance, tests relationship flexibility."
        },
        {
          "id": "arc1_project_sunset_investigation_1_offer_help",
          "text": "Firmly state, \"If there’s real chance to take down Vextros, count me in. But I want all facts first.\"",
          "dialogue_response": "\"That’s the grit we need. But facts are buried deep, and digging them up’ll stir a hornets’ nest. You ready for that?\"",
          "choice_type": "dialogue",
          "player_perspective": "You meet Roxy’s eyes with resolve, making it clear you’re ready to commit but informed.",
          "emotional_tone": "determined, pragmatic",
          "body_language": "Upright posture, steady gaze, voice firm and clear.",
          "requirements": {},
          "attributes_gained": [],
          "attributes_lost": [],
          "stat_changes": {
            "tenacity": 1,
            "expertise": 1
          },
          "next_situation_id": "arc1_project_sunset_investigation_2",
          "internal_hint": "Player commits to cause conditioned on knowledge.",
          "internal_justification": "Sets foundation for future alliance or deeper intrigue."
        }
      ],
      "stat_requirements": {},
      "attribute_requirements": null,
      "consequences": {},
      "is_bridge_node": true,
      "next_situations": []
    }
  },
  "bridge_nodes": [
    "root_echoes_beneath_akropolis_001",
    "informant_whispers_rigged_001",
    "informant_reacts_enforcers_002",
    "intel_vextros_connection_005",
    "informant_deepens_trust_003",
    "informant_responds_hostility_004",
    "atrium_uprising_root",
    "atrium_uprising_acceptance_dialogue",
    "atrium_uprising_vextros_standoff",
    "atrium_uprising_planning_meeting",
    "atrium_uprising_observer",
    "atrium_uprising_cynical_interjection",
    "arc1_root_situation",
    "arc1_investigation_phq9_1",
    "arc1_strategy_discussion_1",
    "arc1_open_blocks_rally_1",
    "arc1_project_sunset_investigation_1"
  ]
}